espressif/esp-idf/components/soc/esp32p4/register/hw_ver3/soc/dma_pms_reg.h
/**
 * SPDX-FileCopyrightText: 2025 Espressif Systems (Shanghai) CO LTD
 *
 *  SPDX-License-Identifier: Apache-2.0 OR MIT
 */
#pragma once

#include "soc/soc.h"
#ifdef __cplusplus
extern "C" {
#endif

/** PMS_DMA_DATE_REG register
 *  Version control register
 */
#define PMS_DMA_DATE_REG (DR_REG_DMA_PMS_BASE + 0x0)
/** PMS_DMA_DATE : R/W; bitpos: [31:0]; default: 539165460;
 *  Version control register.
 */
#define PMS_DMA_DATE    0xFFFFFFFFU
#define PMS_DMA_DATE_M  (PMS_DMA_DATE_V << PMS_DMA_DATE_S)
#define PMS_DMA_DATE_V  0xFFFFFFFFU
#define PMS_DMA_DATE_S  0

/** PMS_DMA_CLK_EN_REG register
 *  Clock gating register
 */
#define PMS_DMA_CLK_EN_REG (DR_REG_DMA_PMS_BASE + 0x4)
/** PMS_DMA_CLK_EN : R/W; bitpos: [0]; default: 1;
 *  Configures whether to keep the clock always on.
 *  0: Enable automatic clock gating.
 *  1: Keep the clock always on.
 */
#define PMS_DMA_CLK_EN    (BIT(0))
#define PMS_DMA_CLK_EN_M  (PMS_DMA_CLK_EN_V << PMS_DMA_CLK_EN_S)
#define PMS_DMA_CLK_EN_V  0x00000001U
#define PMS_DMA_CLK_EN_S  0

/** PMS_DMA_REGION0_LOW_REG register
 *  Region0 start address configuration register
 */
#define PMS_DMA_REGION0_LOW_REG (DR_REG_DMA_PMS_BASE + 0x8)
/** PMS_DMA_REGION0_LOW : R/W; bitpos: [31:12]; default: 0;
 *  Configures the high 20 bits of the start address for region0.
 */
#define PMS_DMA_REGION0_LOW    0x000FFFFFU
#define PMS_DMA_REGION0_LOW_M  (PMS_DMA_REGION0_LOW_V << PMS_DMA_REGION0_LOW_S)
#define PMS_DMA_REGION0_LOW_V  0x000FFFFFU
#define PMS_DMA_REGION0_LOW_S  12

/** PMS_DMA_REGION0_HIGH_REG register
 *  Region0 end address configuration register
 */
#define PMS_DMA_REGION0_HIGH_REG (DR_REG_DMA_PMS_BASE + 0xc)
/** PMS_DMA_REGION0_HIGH : R/W; bitpos: [31:12]; default: 1048575;
 *  Configures the high 20 bits of the end address for region0.
 */
#define PMS_DMA_REGION0_HIGH    0x000FFFFFU
#define PMS_DMA_REGION0_HIGH_M  (PMS_DMA_REGION0_HIGH_V << PMS_DMA_REGION0_HIGH_S)
#define PMS_DMA_REGION0_HIGH_V  0x000FFFFFU
#define PMS_DMA_REGION0_HIGH_S  12

/** PMS_DMA_REGION1_LOW_REG register
 *  Region1 start address configuration register
 */
#define PMS_DMA_REGION1_LOW_REG (DR_REG_DMA_PMS_BASE + 0x10)
/** PMS_DMA_REGION1_LOW : R/W; bitpos: [31:12]; default: 0;
 *  Configures the high 20 bits of the start address for region1.
 */
#define PMS_DMA_REGION1_LOW    0x000FFFFFU
#define PMS_DMA_REGION1_LOW_M  (PMS_DMA_REGION1_LOW_V << PMS_DMA_REGION1_LOW_S)
#define PMS_DMA_REGION1_LOW_V  0x000FFFFFU
#define PMS_DMA_REGION1_LOW_S  12

/** PMS_DMA_REGION1_HIGH_REG register
 *  Region1 end address configuration register
 */
#define PMS_DMA_REGION1_HIGH_REG (DR_REG_DMA_PMS_BASE + 0x14)
/** PMS_DMA_REGION1_HIGH : R/W; bitpos: [31:12]; default: 1048575;
 *  Configures the high 20 bits of the end address for region1.
 */
#define PMS_DMA_REGION1_HIGH    0x000FFFFFU
#define PMS_DMA_REGION1_HIGH_M  (PMS_DMA_REGION1_HIGH_V << PMS_DMA_REGION1_HIGH_S)
#define PMS_DMA_REGION1_HIGH_V  0x000FFFFFU
#define PMS_DMA_REGION1_HIGH_S  12

/** PMS_DMA_REGION2_LOW_REG register
 *  Region2 start address configuration register
 */
#define PMS_DMA_REGION2_LOW_REG (DR_REG_DMA_PMS_BASE + 0x18)
/** PMS_DMA_REGION2_LOW : R/W; bitpos: [31:12]; default: 0;
 *  Configures the high 20 bits of the start address for region2.
 */
#define PMS_DMA_REGION2_LOW    0x000FFFFFU
#define PMS_DMA_REGION2_LOW_M  (PMS_DMA_REGION2_LOW_V << PMS_DMA_REGION2_LOW_S)
#define PMS_DMA_REGION2_LOW_V  0x000FFFFFU
#define PMS_DMA_REGION2_LOW_S  12

/** PMS_DMA_REGION2_HIGH_REG register
 *  Region2 end address configuration register
 */
#define PMS_DMA_REGION2_HIGH_REG (DR_REG_DMA_PMS_BASE + 0x1c)
/** PMS_DMA_REGION2_HIGH : R/W; bitpos: [31:12]; default: 1048575;
 *  Configures the high 20 bits of the end address for region2.
 */
#define PMS_DMA_REGION2_HIGH    0x000FFFFFU
#define PMS_DMA_REGION2_HIGH_M  (PMS_DMA_REGION2_HIGH_V << PMS_DMA_REGION2_HIGH_S)
#define PMS_DMA_REGION2_HIGH_V  0x000FFFFFU
#define PMS_DMA_REGION2_HIGH_S  12

/** PMS_DMA_REGION3_LOW_REG register
 *  Region3 start address configuration register
 */
#define PMS_DMA_REGION3_LOW_REG (DR_REG_DMA_PMS_BASE + 0x20)
/** PMS_DMA_REGION3_LOW : R/W; bitpos: [31:12]; default: 0;
 *  Configures the high 20 bits of the start address for region3.
 */
#define PMS_DMA_REGION3_LOW    0x000FFFFFU
#define PMS_DMA_REGION3_LOW_M  (PMS_DMA_REGION3_LOW_V << PMS_DMA_REGION3_LOW_S)
#define PMS_DMA_REGION3_LOW_V  0x000FFFFFU
#define PMS_DMA_REGION3_LOW_S  12

/** PMS_DMA_REGION3_HIGH_REG register
 *  Region3 end address configuration register
 */
#define PMS_DMA_REGION3_HIGH_REG (DR_REG_DMA_PMS_BASE + 0x24)
/** PMS_DMA_REGION3_HIGH : R/W; bitpos: [31:12]; default: 1048575;
 *  Configures the high 20 bits of the end address for region3.
 */
#define PMS_DMA_REGION3_HIGH    0x000FFFFFU
#define PMS_DMA_REGION3_HIGH_M  (PMS_DMA_REGION3_HIGH_V << PMS_DMA_REGION3_HIGH_S)
#define PMS_DMA_REGION3_HIGH_V  0x000FFFFFU
#define PMS_DMA_REGION3_HIGH_S  12

/** PMS_DMA_REGION4_LOW_REG register
 *  Region4 start address configuration register
 */
#define PMS_DMA_REGION4_LOW_REG (DR_REG_DMA_PMS_BASE + 0x28)
/** PMS_DMA_REGION4_LOW : R/W; bitpos: [31:12]; default: 0;
 *  Configures the high 20 bits of the start address for region4.
 */
#define PMS_DMA_REGION4_LOW    0x000FFFFFU
#define PMS_DMA_REGION4_LOW_M  (PMS_DMA_REGION4_LOW_V << PMS_DMA_REGION4_LOW_S)
#define PMS_DMA_REGION4_LOW_V  0x000FFFFFU
#define PMS_DMA_REGION4_LOW_S  12

/** PMS_DMA_REGION4_HIGH_REG register
 *  Region4 end address configuration register
 */
#define PMS_DMA_REGION4_HIGH_REG (DR_REG_DMA_PMS_BASE + 0x2c)
/** PMS_DMA_REGION4_HIGH : R/W; bitpos: [31:12]; default: 1048575;
 *  Configures the high 20 bits of the end address for region4.
 */
#define PMS_DMA_REGION4_HIGH    0x000FFFFFU
#define PMS_DMA_REGION4_HIGH_M  (PMS_DMA_REGION4_HIGH_V << PMS_DMA_REGION4_HIGH_S)
#define PMS_DMA_REGION4_HIGH_V  0x000FFFFFU
#define PMS_DMA_REGION4_HIGH_S  12

/** PMS_DMA_REGION5_LOW_REG register
 *  Region5 start address configuration register
 */
#define PMS_DMA_REGION5_LOW_REG (DR_REG_DMA_PMS_BASE + 0x30)
/** PMS_DMA_REGION5_LOW : R/W; bitpos: [31:12]; default: 0;
 *  Configures the high 20 bits of the start address for region5.
 */
#define PMS_DMA_REGION5_LOW    0x000FFFFFU
#define PMS_DMA_REGION5_LOW_M  (PMS_DMA_REGION5_LOW_V << PMS_DMA_REGION5_LOW_S)
#define PMS_DMA_REGION5_LOW_V  0x000FFFFFU
#define PMS_DMA_REGION5_LOW_S  12

/** PMS_DMA_REGION5_HIGH_REG register
 *  Region5 end address configuration register
 */
#define PMS_DMA_REGION5_HIGH_REG (DR_REG_DMA_PMS_BASE + 0x34)
/** PMS_DMA_REGION5_HIGH : R/W; bitpos: [31:12]; default: 1048575;
 *  Configures the high 20 bits of the end address for region5.
 */
#define PMS_DMA_REGION5_HIGH    0x000FFFFFU
#define PMS_DMA_REGION5_HIGH_M  (PMS_DMA_REGION5_HIGH_V << PMS_DMA_REGION5_HIGH_S)
#define PMS_DMA_REGION5_HIGH_V  0x000FFFFFU
#define PMS_DMA_REGION5_HIGH_S  12

