espressif/esp-idf/components/soc/esp32p4/register/hw_ver3/soc/dma_pms_reg.h
/** PMS_DMA_REGION6_LOW_REG register
 *  Region6 start address configuration register
 */
#define PMS_DMA_REGION6_LOW_REG (DR_REG_DMA_PMS_BASE + 0x38)
/** PMS_DMA_REGION6_LOW : R/W; bitpos: [31:12]; default: 0;
 *  Configures the high 20 bits of the start address for region6.
 */
#define PMS_DMA_REGION6_LOW    0x000FFFFFU
#define PMS_DMA_REGION6_LOW_M  (PMS_DMA_REGION6_LOW_V << PMS_DMA_REGION6_LOW_S)
#define PMS_DMA_REGION6_LOW_V  0x000FFFFFU
#define PMS_DMA_REGION6_LOW_S  12

/** PMS_DMA_REGION6_HIGH_REG register
 *  Region6 end address configuration register
 */
#define PMS_DMA_REGION6_HIGH_REG (DR_REG_DMA_PMS_BASE + 0x3c)
/** PMS_DMA_REGION6_HIGH : R/W; bitpos: [31:12]; default: 1048575;
 *  Configures the high 20 bits of the end address for region6.
 */
#define PMS_DMA_REGION6_HIGH    0x000FFFFFU
#define PMS_DMA_REGION6_HIGH_M  (PMS_DMA_REGION6_HIGH_V << PMS_DMA_REGION6_HIGH_S)
#define PMS_DMA_REGION6_HIGH_V  0x000FFFFFU
#define PMS_DMA_REGION6_HIGH_S  12

/** PMS_DMA_REGION7_LOW_REG register
 *  Region7 start address configuration register
 */
#define PMS_DMA_REGION7_LOW_REG (DR_REG_DMA_PMS_BASE + 0x40)
/** PMS_DMA_REGION7_LOW : R/W; bitpos: [31:12]; default: 0;
 *  Configures the high 20 bits of the start address for region7.
 */
#define PMS_DMA_REGION7_LOW    0x000FFFFFU
#define PMS_DMA_REGION7_LOW_M  (PMS_DMA_REGION7_LOW_V << PMS_DMA_REGION7_LOW_S)
#define PMS_DMA_REGION7_LOW_V  0x000FFFFFU
#define PMS_DMA_REGION7_LOW_S  12

/** PMS_DMA_REGION7_HIGH_REG register
 *  Region7 end address configuration register
 */
#define PMS_DMA_REGION7_HIGH_REG (DR_REG_DMA_PMS_BASE + 0x44)
/** PMS_DMA_REGION7_HIGH : R/W; bitpos: [31:12]; default: 1048575;
 *  Configures the high 20 bits of the end address for region7.
 */
#define PMS_DMA_REGION7_HIGH    0x000FFFFFU
#define PMS_DMA_REGION7_HIGH_M  (PMS_DMA_REGION7_HIGH_V << PMS_DMA_REGION7_HIGH_S)
#define PMS_DMA_REGION7_HIGH_V  0x000FFFFFU
#define PMS_DMA_REGION7_HIGH_S  12

/** PMS_DMA_REGION8_LOW_REG register
 *  Region8 start address configuration register
 */
#define PMS_DMA_REGION8_LOW_REG (DR_REG_DMA_PMS_BASE + 0x48)
/** PMS_DMA_REGION8_LOW : R/W; bitpos: [31:12]; default: 0;
 *  Configures the high 20 bits of the start address for region8.
 */
#define PMS_DMA_REGION8_LOW    0x000FFFFFU
#define PMS_DMA_REGION8_LOW_M  (PMS_DMA_REGION8_LOW_V << PMS_DMA_REGION8_LOW_S)
#define PMS_DMA_REGION8_LOW_V  0x000FFFFFU
#define PMS_DMA_REGION8_LOW_S  12

/** PMS_DMA_REGION8_HIGH_REG register
 *  Region8 end address configuration register
 */
#define PMS_DMA_REGION8_HIGH_REG (DR_REG_DMA_PMS_BASE + 0x4c)
/** PMS_DMA_REGION8_HIGH : R/W; bitpos: [31:12]; default: 1048575;
 *  Configures the high 20 bits of the end address for region8.
 */
#define PMS_DMA_REGION8_HIGH    0x000FFFFFU
#define PMS_DMA_REGION8_HIGH_M  (PMS_DMA_REGION8_HIGH_V << PMS_DMA_REGION8_HIGH_S)
#define PMS_DMA_REGION8_HIGH_V  0x000FFFFFU
#define PMS_DMA_REGION8_HIGH_S  12

/** PMS_DMA_REGION9_LOW_REG register
 *  Region9 start address configuration register
 */
#define PMS_DMA_REGION9_LOW_REG (DR_REG_DMA_PMS_BASE + 0x50)
/** PMS_DMA_REGION9_LOW : R/W; bitpos: [31:12]; default: 0;
 *  Configures the high 20 bits of the start address for region9.
 */
#define PMS_DMA_REGION9_LOW    0x000FFFFFU
#define PMS_DMA_REGION9_LOW_M  (PMS_DMA_REGION9_LOW_V << PMS_DMA_REGION9_LOW_S)
#define PMS_DMA_REGION9_LOW_V  0x000FFFFFU
#define PMS_DMA_REGION9_LOW_S  12

/** PMS_DMA_REGION9_HIGH_REG register
 *  Region9 end address configuration register
 */
#define PMS_DMA_REGION9_HIGH_REG (DR_REG_DMA_PMS_BASE + 0x54)
/** PMS_DMA_REGION9_HIGH : R/W; bitpos: [31:12]; default: 1048575;
 *  Configures the high 20 bits of the end address for region9.
 */
#define PMS_DMA_REGION9_HIGH    0x000FFFFFU
#define PMS_DMA_REGION9_HIGH_M  (PMS_DMA_REGION9_HIGH_V << PMS_DMA_REGION9_HIGH_S)
#define PMS_DMA_REGION9_HIGH_V  0x000FFFFFU
#define PMS_DMA_REGION9_HIGH_S  12

/** PMS_DMA_REGION10_LOW_REG register
 *  Region10 start address configuration register
 */
#define PMS_DMA_REGION10_LOW_REG (DR_REG_DMA_PMS_BASE + 0x58)
/** PMS_DMA_REGION10_LOW : R/W; bitpos: [31:12]; default: 0;
 *  Configures the high 20 bits of the start address for region10.
 */
#define PMS_DMA_REGION10_LOW    0x000FFFFFU
#define PMS_DMA_REGION10_LOW_M  (PMS_DMA_REGION10_LOW_V << PMS_DMA_REGION10_LOW_S)
#define PMS_DMA_REGION10_LOW_V  0x000FFFFFU
#define PMS_DMA_REGION10_LOW_S  12

/** PMS_DMA_REGION10_HIGH_REG register
 *  Region10 end address configuration register
 */
#define PMS_DMA_REGION10_HIGH_REG (DR_REG_DMA_PMS_BASE + 0x5c)
/** PMS_DMA_REGION10_HIGH : R/W; bitpos: [31:12]; default: 1048575;
 *  Configures the high 20 bits of the end address for region10.
 */
#define PMS_DMA_REGION10_HIGH    0x000FFFFFU
#define PMS_DMA_REGION10_HIGH_M  (PMS_DMA_REGION10_HIGH_V << PMS_DMA_REGION10_HIGH_S)
#define PMS_DMA_REGION10_HIGH_V  0x000FFFFFU
#define PMS_DMA_REGION10_HIGH_S  12

/** PMS_DMA_REGION11_LOW_REG register
 *  Region11 start address configuration register
 */
#define PMS_DMA_REGION11_LOW_REG (DR_REG_DMA_PMS_BASE + 0x60)
/** PMS_DMA_REGION11_LOW : R/W; bitpos: [31:12]; default: 0;
 *  Configures the high 20 bits of the start address for region11.
 */
#define PMS_DMA_REGION11_LOW    0x000FFFFFU
#define PMS_DMA_REGION11_LOW_M  (PMS_DMA_REGION11_LOW_V << PMS_DMA_REGION11_LOW_S)
#define PMS_DMA_REGION11_LOW_V  0x000FFFFFU
#define PMS_DMA_REGION11_LOW_S  12

/** PMS_DMA_REGION11_HIGH_REG register
 *  Region11 end address configuration register
 */
#define PMS_DMA_REGION11_HIGH_REG (DR_REG_DMA_PMS_BASE + 0x64)
/** PMS_DMA_REGION11_HIGH : R/W; bitpos: [31:12]; default: 1048575;
 *  Configures the high 20 bits of the end address for region11.
 */
#define PMS_DMA_REGION11_HIGH    0x000FFFFFU
#define PMS_DMA_REGION11_HIGH_M  (PMS_DMA_REGION11_HIGH_V << PMS_DMA_REGION11_HIGH_S)
#define PMS_DMA_REGION11_HIGH_V  0x000FFFFFU
#define PMS_DMA_REGION11_HIGH_S  12

/** PMS_DMA_REGION12_LOW_REG register
 *  Region12 start address configuration register
 */
#define PMS_DMA_REGION12_LOW_REG (DR_REG_DMA_PMS_BASE + 0x68)
/** PMS_DMA_REGION12_LOW : R/W; bitpos: [31:12]; default: 0;
 *  Configures the high 20 bits of the start address for region12.
 */
#define PMS_DMA_REGION12_LOW    0x000FFFFFU
#define PMS_DMA_REGION12_LOW_M  (PMS_DMA_REGION12_LOW_V << PMS_DMA_REGION12_LOW_S)
#define PMS_DMA_REGION12_LOW_V  0x000FFFFFU
#define PMS_DMA_REGION12_LOW_S  12

/** PMS_DMA_REGION12_HIGH_REG register
 *  Region12 end address configuration register
 */
#define PMS_DMA_REGION12_HIGH_REG (DR_REG_DMA_PMS_BASE + 0x6c)
/** PMS_DMA_REGION12_HIGH : R/W; bitpos: [31:12]; default: 1048575;
 *  Configures the high 20 bits of the end address for region12.
 */
#define PMS_DMA_REGION12_HIGH    0x000FFFFFU
#define PMS_DMA_REGION12_HIGH_M  (PMS_DMA_REGION12_HIGH_V << PMS_DMA_REGION12_HIGH_S)
#define PMS_DMA_REGION12_HIGH_V  0x000FFFFFU
#define PMS_DMA_REGION12_HIGH_S  12

