espressif/esp-idf/components/soc/esp32p4/register/hw_ver3/soc/dma_pms_reg.h
/** PMS_DMA_REGION13_LOW_REG register
 *  Region13 start address configuration register
 */
#define PMS_DMA_REGION13_LOW_REG (DR_REG_DMA_PMS_BASE + 0x70)
/** PMS_DMA_REGION13_LOW : R/W; bitpos: [31:12]; default: 0;
 *  Configures the high 20 bits of the start address for region13.
 */
#define PMS_DMA_REGION13_LOW    0x000FFFFFU
#define PMS_DMA_REGION13_LOW_M  (PMS_DMA_REGION13_LOW_V << PMS_DMA_REGION13_LOW_S)
#define PMS_DMA_REGION13_LOW_V  0x000FFFFFU
#define PMS_DMA_REGION13_LOW_S  12

/** PMS_DMA_REGION13_HIGH_REG register
 *  Region13 end address configuration register
 */
#define PMS_DMA_REGION13_HIGH_REG (DR_REG_DMA_PMS_BASE + 0x74)
/** PMS_DMA_REGION13_HIGH : R/W; bitpos: [31:12]; default: 1048575;
 *  Configures the high 20 bits of the end address for region13.
 */
#define PMS_DMA_REGION13_HIGH    0x000FFFFFU
#define PMS_DMA_REGION13_HIGH_M  (PMS_DMA_REGION13_HIGH_V << PMS_DMA_REGION13_HIGH_S)
#define PMS_DMA_REGION13_HIGH_V  0x000FFFFFU
#define PMS_DMA_REGION13_HIGH_S  12

/** PMS_DMA_REGION14_LOW_REG register
 *  Region14 start address configuration register
 */
#define PMS_DMA_REGION14_LOW_REG (DR_REG_DMA_PMS_BASE + 0x78)
/** PMS_DMA_REGION14_LOW : R/W; bitpos: [31:12]; default: 0;
 *  Configures the high 20 bits of the start address for region14.
 */
#define PMS_DMA_REGION14_LOW    0x000FFFFFU
#define PMS_DMA_REGION14_LOW_M  (PMS_DMA_REGION14_LOW_V << PMS_DMA_REGION14_LOW_S)
#define PMS_DMA_REGION14_LOW_V  0x000FFFFFU
#define PMS_DMA_REGION14_LOW_S  12

/** PMS_DMA_REGION14_HIGH_REG register
 *  Region14 end address configuration register
 */
#define PMS_DMA_REGION14_HIGH_REG (DR_REG_DMA_PMS_BASE + 0x7c)
/** PMS_DMA_REGION14_HIGH : R/W; bitpos: [31:12]; default: 1048575;
 *  Configures the high 20 bits of the end address for region14.
 */
#define PMS_DMA_REGION14_HIGH    0x000FFFFFU
#define PMS_DMA_REGION14_HIGH_M  (PMS_DMA_REGION14_HIGH_V << PMS_DMA_REGION14_HIGH_S)
#define PMS_DMA_REGION14_HIGH_V  0x000FFFFFU
#define PMS_DMA_REGION14_HIGH_S  12

/** PMS_DMA_REGION15_LOW_REG register
 *  Region15 start address configuration register
 */
#define PMS_DMA_REGION15_LOW_REG (DR_REG_DMA_PMS_BASE + 0x80)
/** PMS_DMA_REGION15_LOW : R/W; bitpos: [31:12]; default: 0;
 *  Configures the high 20 bits of the start address for region15.
 */
#define PMS_DMA_REGION15_LOW    0x000FFFFFU
#define PMS_DMA_REGION15_LOW_M  (PMS_DMA_REGION15_LOW_V << PMS_DMA_REGION15_LOW_S)
#define PMS_DMA_REGION15_LOW_V  0x000FFFFFU
#define PMS_DMA_REGION15_LOW_S  12

/** PMS_DMA_REGION15_HIGH_REG register
 *  Region15 end address configuration register
 */
#define PMS_DMA_REGION15_HIGH_REG (DR_REG_DMA_PMS_BASE + 0x84)
/** PMS_DMA_REGION15_HIGH : R/W; bitpos: [31:12]; default: 1048575;
 *  Configures the high 20 bits of the end address for region15.
 */
#define PMS_DMA_REGION15_HIGH    0x000FFFFFU
#define PMS_DMA_REGION15_HIGH_M  (PMS_DMA_REGION15_HIGH_V << PMS_DMA_REGION15_HIGH_S)
#define PMS_DMA_REGION15_HIGH_V  0x000FFFFFU
#define PMS_DMA_REGION15_HIGH_S  12

/** PMS_DMA_REGION16_LOW_REG register
 *  Region16 start address configuration register
 */
#define PMS_DMA_REGION16_LOW_REG (DR_REG_DMA_PMS_BASE + 0x88)
/** PMS_DMA_REGION16_LOW : R/W; bitpos: [31:12]; default: 0;
 *  Configures the high 20 bits of the start address for region16.
 */
#define PMS_DMA_REGION16_LOW    0x000FFFFFU
#define PMS_DMA_REGION16_LOW_M  (PMS_DMA_REGION16_LOW_V << PMS_DMA_REGION16_LOW_S)
#define PMS_DMA_REGION16_LOW_V  0x000FFFFFU
#define PMS_DMA_REGION16_LOW_S  12

/** PMS_DMA_REGION16_HIGH_REG register
 *  Region16 end address configuration register
 */
#define PMS_DMA_REGION16_HIGH_REG (DR_REG_DMA_PMS_BASE + 0x8c)
/** PMS_DMA_REGION16_HIGH : R/W; bitpos: [31:12]; default: 1048575;
 *  Configures the high 20 bits of the end address for region16.
 */
#define PMS_DMA_REGION16_HIGH    0x000FFFFFU
#define PMS_DMA_REGION16_HIGH_M  (PMS_DMA_REGION16_HIGH_V << PMS_DMA_REGION16_HIGH_S)
#define PMS_DMA_REGION16_HIGH_V  0x000FFFFFU
#define PMS_DMA_REGION16_HIGH_S  12

/** PMS_DMA_REGION17_LOW_REG register
 *  Region17 start address configuration register
 */
#define PMS_DMA_REGION17_LOW_REG (DR_REG_DMA_PMS_BASE + 0x90)
/** PMS_DMA_REGION17_LOW : R/W; bitpos: [31:12]; default: 0;
 *  Configures the high 20 bits of the start address for region17.
 */
#define PMS_DMA_REGION17_LOW    0x000FFFFFU
#define PMS_DMA_REGION17_LOW_M  (PMS_DMA_REGION17_LOW_V << PMS_DMA_REGION17_LOW_S)
#define PMS_DMA_REGION17_LOW_V  0x000FFFFFU
#define PMS_DMA_REGION17_LOW_S  12

/** PMS_DMA_REGION17_HIGH_REG register
 *  Region17 end address configuration register
 */
#define PMS_DMA_REGION17_HIGH_REG (DR_REG_DMA_PMS_BASE + 0x94)
/** PMS_DMA_REGION17_HIGH : R/W; bitpos: [31:12]; default: 1048575;
 *  Configures the high 20 bits of the end address for region17.
 */
#define PMS_DMA_REGION17_HIGH    0x000FFFFFU
#define PMS_DMA_REGION17_HIGH_M  (PMS_DMA_REGION17_HIGH_V << PMS_DMA_REGION17_HIGH_S)
#define PMS_DMA_REGION17_HIGH_V  0x000FFFFFU
#define PMS_DMA_REGION17_HIGH_S  12

/** PMS_DMA_REGION18_LOW_REG register
 *  Region18 start address configuration register
 */
#define PMS_DMA_REGION18_LOW_REG (DR_REG_DMA_PMS_BASE + 0x98)
/** PMS_DMA_REGION18_LOW : R/W; bitpos: [31:12]; default: 0;
 *  Configures the high 20 bits of the start address for region18.
 */
#define PMS_DMA_REGION18_LOW    0x000FFFFFU
#define PMS_DMA_REGION18_LOW_M  (PMS_DMA_REGION18_LOW_V << PMS_DMA_REGION18_LOW_S)
#define PMS_DMA_REGION18_LOW_V  0x000FFFFFU
#define PMS_DMA_REGION18_LOW_S  12

/** PMS_DMA_REGION18_HIGH_REG register
 *  Region18 end address configuration register
 */
#define PMS_DMA_REGION18_HIGH_REG (DR_REG_DMA_PMS_BASE + 0x9c)
/** PMS_DMA_REGION18_HIGH : R/W; bitpos: [31:12]; default: 1048575;
 *  Configures the high 20 bits of the end address for region18.
 */
#define PMS_DMA_REGION18_HIGH    0x000FFFFFU
#define PMS_DMA_REGION18_HIGH_M  (PMS_DMA_REGION18_HIGH_V << PMS_DMA_REGION18_HIGH_S)
#define PMS_DMA_REGION18_HIGH_V  0x000FFFFFU
#define PMS_DMA_REGION18_HIGH_S  12

/** PMS_DMA_REGION19_LOW_REG register
 *  Region19 start address configuration register
 */
#define PMS_DMA_REGION19_LOW_REG (DR_REG_DMA_PMS_BASE + 0xa0)
/** PMS_DMA_REGION19_LOW : R/W; bitpos: [31:12]; default: 0;
 *  Configures the high 20 bits of the start address for region19.
 */
#define PMS_DMA_REGION19_LOW    0x000FFFFFU
#define PMS_DMA_REGION19_LOW_M  (PMS_DMA_REGION19_LOW_V << PMS_DMA_REGION19_LOW_S)
#define PMS_DMA_REGION19_LOW_V  0x000FFFFFU
#define PMS_DMA_REGION19_LOW_S  12

/** PMS_DMA_REGION19_HIGH_REG register
 *  Region19 end address configuration register
 */
#define PMS_DMA_REGION19_HIGH_REG (DR_REG_DMA_PMS_BASE + 0xa4)
/** PMS_DMA_REGION19_HIGH : R/W; bitpos: [31:12]; default: 1048575;
 *  Configures the high 20 bits of the end address for region19.
 */
#define PMS_DMA_REGION19_HIGH    0x000FFFFFU
#define PMS_DMA_REGION19_HIGH_M  (PMS_DMA_REGION19_HIGH_V << PMS_DMA_REGION19_HIGH_S)
#define PMS_DMA_REGION19_HIGH_V  0x000FFFFFU
#define PMS_DMA_REGION19_HIGH_S  12

/** PMS_DMA_REGION20_LOW_REG register
 *  Region20 start address configuration register
 */
#define PMS_DMA_REGION20_LOW_REG (DR_REG_DMA_PMS_BASE + 0xa8)
/** PMS_DMA_REGION20_LOW : R/W; bitpos: [31:12]; default: 0;
 *  Configures the high 20 bits of the start address for region20.
 */
#define PMS_DMA_REGION20_LOW    0x000FFFFFU
#define PMS_DMA_REGION20_LOW_M  (PMS_DMA_REGION20_LOW_V << PMS_DMA_REGION20_LOW_S)
#define PMS_DMA_REGION20_LOW_V  0x000FFFFFU
#define PMS_DMA_REGION20_LOW_S  12

/** PMS_DMA_REGION20_HIGH_REG register
 *  Region20 end address configuration register
 */
#define PMS_DMA_REGION20_HIGH_REG (DR_REG_DMA_PMS_BASE + 0xac)
/** PMS_DMA_REGION20_HIGH : R/W; bitpos: [31:12]; default: 1048575;
 *  Configures the high 20 bits of the end address for region20.
 */
#define PMS_DMA_REGION20_HIGH    0x000FFFFFU
#define PMS_DMA_REGION20_HIGH_M  (PMS_DMA_REGION20_HIGH_V << PMS_DMA_REGION20_HIGH_S)
#define PMS_DMA_REGION20_HIGH_V  0x000FFFFFU
#define PMS_DMA_REGION20_HIGH_S  12

/** PMS_DMA_REGION21_LOW_REG register
 *  Region21 start address configuration register
 */
#define PMS_DMA_REGION21_LOW_REG (DR_REG_DMA_PMS_BASE + 0xb0)
/** PMS_DMA_REGION21_LOW : R/W; bitpos: [31:12]; default: 0;
 *  Configures the high 20 bits of the start address for region21.
 */
#define PMS_DMA_REGION21_LOW    0x000FFFFFU
#define PMS_DMA_REGION21_LOW_M  (PMS_DMA_REGION21_LOW_V << PMS_DMA_REGION21_LOW_S)
#define PMS_DMA_REGION21_LOW_V  0x000FFFFFU
#define PMS_DMA_REGION21_LOW_S  12

/** PMS_DMA_REGION21_HIGH_REG register
 *  Region21 end address configuration register
 */
#define PMS_DMA_REGION21_HIGH_REG (DR_REG_DMA_PMS_BASE + 0xb4)
/** PMS_DMA_REGION21_HIGH : R/W; bitpos: [31:12]; default: 1048575;
 *  Configures the high 20 bits of the end address for region21.
 */
#define PMS_DMA_REGION21_HIGH    0x000FFFFFU
#define PMS_DMA_REGION21_HIGH_M  (PMS_DMA_REGION21_HIGH_V << PMS_DMA_REGION21_HIGH_S)
#define PMS_DMA_REGION21_HIGH_V  0x000FFFFFU
#define PMS_DMA_REGION21_HIGH_S  12

