espressif/esp-idf/components/soc/esp32p4/register/hw_ver3/soc/dma_pms_reg.h
/** PMS_DMA_REGION22_LOW_REG register
 *  Region22 start address configuration register
 */
#define PMS_DMA_REGION22_LOW_REG (DR_REG_DMA_PMS_BASE + 0xb8)
/** PMS_DMA_REGION22_LOW : R/W; bitpos: [31:12]; default: 0;
 *  Configures the high 20 bits of the start address for region22.
 */
#define PMS_DMA_REGION22_LOW    0x000FFFFFU
#define PMS_DMA_REGION22_LOW_M  (PMS_DMA_REGION22_LOW_V << PMS_DMA_REGION22_LOW_S)
#define PMS_DMA_REGION22_LOW_V  0x000FFFFFU
#define PMS_DMA_REGION22_LOW_S  12

/** PMS_DMA_REGION22_HIGH_REG register
 *  Region22 end address configuration register
 */
#define PMS_DMA_REGION22_HIGH_REG (DR_REG_DMA_PMS_BASE + 0xbc)
/** PMS_DMA_REGION22_HIGH : R/W; bitpos: [31:12]; default: 1048575;
 *  Configures the high 20 bits of the end address for region22.
 */
#define PMS_DMA_REGION22_HIGH    0x000FFFFFU
#define PMS_DMA_REGION22_HIGH_M  (PMS_DMA_REGION22_HIGH_V << PMS_DMA_REGION22_HIGH_S)
#define PMS_DMA_REGION22_HIGH_V  0x000FFFFFU
#define PMS_DMA_REGION22_HIGH_S  12

/** PMS_DMA_REGION23_LOW_REG register
 *  Region23 start address configuration register
 */
#define PMS_DMA_REGION23_LOW_REG (DR_REG_DMA_PMS_BASE + 0xc0)
/** PMS_DMA_REGION23_LOW : R/W; bitpos: [31:12]; default: 0;
 *  Configures the high 20 bits of the start address for region23.
 */
#define PMS_DMA_REGION23_LOW    0x000FFFFFU
#define PMS_DMA_REGION23_LOW_M  (PMS_DMA_REGION23_LOW_V << PMS_DMA_REGION23_LOW_S)
#define PMS_DMA_REGION23_LOW_V  0x000FFFFFU
#define PMS_DMA_REGION23_LOW_S  12

/** PMS_DMA_REGION23_HIGH_REG register
 *  Region23 end address configuration register
 */
#define PMS_DMA_REGION23_HIGH_REG (DR_REG_DMA_PMS_BASE + 0xc4)
/** PMS_DMA_REGION23_HIGH : R/W; bitpos: [31:12]; default: 1048575;
 *  Configures the high 20 bits of the end address for region23.
 */
#define PMS_DMA_REGION23_HIGH    0x000FFFFFU
#define PMS_DMA_REGION23_HIGH_M  (PMS_DMA_REGION23_HIGH_V << PMS_DMA_REGION23_HIGH_S)
#define PMS_DMA_REGION23_HIGH_V  0x000FFFFFU
#define PMS_DMA_REGION23_HIGH_S  12

/** PMS_DMA_REGION24_LOW_REG register
 *  Region24 start address configuration register
 */
#define PMS_DMA_REGION24_LOW_REG (DR_REG_DMA_PMS_BASE + 0xc8)
/** PMS_DMA_REGION24_LOW : R/W; bitpos: [31:12]; default: 0;
 *  Configures the high 20 bits of the start address for region24.
 */
#define PMS_DMA_REGION24_LOW    0x000FFFFFU
#define PMS_DMA_REGION24_LOW_M  (PMS_DMA_REGION24_LOW_V << PMS_DMA_REGION24_LOW_S)
#define PMS_DMA_REGION24_LOW_V  0x000FFFFFU
#define PMS_DMA_REGION24_LOW_S  12

/** PMS_DMA_REGION24_HIGH_REG register
 *  Region24 end address configuration register
 */
#define PMS_DMA_REGION24_HIGH_REG (DR_REG_DMA_PMS_BASE + 0xcc)
/** PMS_DMA_REGION24_HIGH : R/W; bitpos: [31:12]; default: 1048575;
 *  Configures the high 20 bits of the end address for region24.
 */
#define PMS_DMA_REGION24_HIGH    0x000FFFFFU
#define PMS_DMA_REGION24_HIGH_M  (PMS_DMA_REGION24_HIGH_V << PMS_DMA_REGION24_HIGH_S)
#define PMS_DMA_REGION24_HIGH_V  0x000FFFFFU
#define PMS_DMA_REGION24_HIGH_S  12

/** PMS_DMA_REGION25_LOW_REG register
 *  Region25 start address configuration register
 */
#define PMS_DMA_REGION25_LOW_REG (DR_REG_DMA_PMS_BASE + 0xd0)
/** PMS_DMA_REGION25_LOW : R/W; bitpos: [31:12]; default: 0;
 *  Configures the high 20 bits of the start address for region25.
 */
#define PMS_DMA_REGION25_LOW    0x000FFFFFU
#define PMS_DMA_REGION25_LOW_M  (PMS_DMA_REGION25_LOW_V << PMS_DMA_REGION25_LOW_S)
#define PMS_DMA_REGION25_LOW_V  0x000FFFFFU
#define PMS_DMA_REGION25_LOW_S  12

/** PMS_DMA_REGION25_HIGH_REG register
 *  Region25 end address configuration register
 */
#define PMS_DMA_REGION25_HIGH_REG (DR_REG_DMA_PMS_BASE + 0xd4)
/** PMS_DMA_REGION25_HIGH : R/W; bitpos: [31:12]; default: 1048575;
 *  Configures the high 20 bits of the end address for region25.
 */
#define PMS_DMA_REGION25_HIGH    0x000FFFFFU
#define PMS_DMA_REGION25_HIGH_M  (PMS_DMA_REGION25_HIGH_V << PMS_DMA_REGION25_HIGH_S)
#define PMS_DMA_REGION25_HIGH_V  0x000FFFFFU
#define PMS_DMA_REGION25_HIGH_S  12

/** PMS_DMA_REGION26_LOW_REG register
 *  Region26 start address configuration register
 */
#define PMS_DMA_REGION26_LOW_REG (DR_REG_DMA_PMS_BASE + 0xd8)
/** PMS_DMA_REGION26_LOW : R/W; bitpos: [31:12]; default: 0;
 *  Configures the high 20 bits of the start address for region26.
 */
#define PMS_DMA_REGION26_LOW    0x000FFFFFU
#define PMS_DMA_REGION26_LOW_M  (PMS_DMA_REGION26_LOW_V << PMS_DMA_REGION26_LOW_S)
#define PMS_DMA_REGION26_LOW_V  0x000FFFFFU
#define PMS_DMA_REGION26_LOW_S  12

/** PMS_DMA_REGION26_HIGH_REG register
 *  Region26 end address configuration register
 */
#define PMS_DMA_REGION26_HIGH_REG (DR_REG_DMA_PMS_BASE + 0xdc)
/** PMS_DMA_REGION26_HIGH : R/W; bitpos: [31:12]; default: 1048575;
 *  Configures the high 20 bits of the end address for region26.
 */
#define PMS_DMA_REGION26_HIGH    0x000FFFFFU
#define PMS_DMA_REGION26_HIGH_M  (PMS_DMA_REGION26_HIGH_V << PMS_DMA_REGION26_HIGH_S)
#define PMS_DMA_REGION26_HIGH_V  0x000FFFFFU
#define PMS_DMA_REGION26_HIGH_S  12

/** PMS_DMA_REGION27_LOW_REG register
 *  Region27 start address configuration register
 */
#define PMS_DMA_REGION27_LOW_REG (DR_REG_DMA_PMS_BASE + 0xe0)
/** PMS_DMA_REGION27_LOW : R/W; bitpos: [31:12]; default: 0;
 *  Configures the high 20 bits of the start address for region27.
 */
#define PMS_DMA_REGION27_LOW    0x000FFFFFU
#define PMS_DMA_REGION27_LOW_M  (PMS_DMA_REGION27_LOW_V << PMS_DMA_REGION27_LOW_S)
#define PMS_DMA_REGION27_LOW_V  0x000FFFFFU
#define PMS_DMA_REGION27_LOW_S  12

/** PMS_DMA_REGION27_HIGH_REG register
 *  Region27 end address configuration register
 */
#define PMS_DMA_REGION27_HIGH_REG (DR_REG_DMA_PMS_BASE + 0xe4)
/** PMS_DMA_REGION27_HIGH : R/W; bitpos: [31:12]; default: 1048575;
 *  Configures the high 20 bits of the end address for region27.
 */
#define PMS_DMA_REGION27_HIGH    0x000FFFFFU
#define PMS_DMA_REGION27_HIGH_M  (PMS_DMA_REGION27_HIGH_V << PMS_DMA_REGION27_HIGH_S)
#define PMS_DMA_REGION27_HIGH_V  0x000FFFFFU
#define PMS_DMA_REGION27_HIGH_S  12

/** PMS_DMA_REGION28_LOW_REG register
 *  Region28 start address configuration register
 */
#define PMS_DMA_REGION28_LOW_REG (DR_REG_DMA_PMS_BASE + 0xe8)
/** PMS_DMA_REGION28_LOW : R/W; bitpos: [31:12]; default: 0;
 *  Configures the high 20 bits of the start address for region28.
 */
#define PMS_DMA_REGION28_LOW    0x000FFFFFU
#define PMS_DMA_REGION28_LOW_M  (PMS_DMA_REGION28_LOW_V << PMS_DMA_REGION28_LOW_S)
#define PMS_DMA_REGION28_LOW_V  0x000FFFFFU
#define PMS_DMA_REGION28_LOW_S  12

/** PMS_DMA_REGION28_HIGH_REG register
 *  Region28 end address configuration register
 */
#define PMS_DMA_REGION28_HIGH_REG (DR_REG_DMA_PMS_BASE + 0xec)
/** PMS_DMA_REGION28_HIGH : R/W; bitpos: [31:12]; default: 1048575;
 *  Configures the high 20 bits of the end address for region28.
 */
#define PMS_DMA_REGION28_HIGH    0x000FFFFFU
#define PMS_DMA_REGION28_HIGH_M  (PMS_DMA_REGION28_HIGH_V << PMS_DMA_REGION28_HIGH_S)
#define PMS_DMA_REGION28_HIGH_V  0x000FFFFFU
#define PMS_DMA_REGION28_HIGH_S  12

/** PMS_DMA_REGION29_LOW_REG register
 *  Region29 start address configuration register
 */
#define PMS_DMA_REGION29_LOW_REG (DR_REG_DMA_PMS_BASE + 0xf0)
/** PMS_DMA_REGION29_LOW : R/W; bitpos: [31:12]; default: 0;
 *  Configures the high 20 bits of the start address for region29.
 */
#define PMS_DMA_REGION29_LOW    0x000FFFFFU
#define PMS_DMA_REGION29_LOW_M  (PMS_DMA_REGION29_LOW_V << PMS_DMA_REGION29_LOW_S)
#define PMS_DMA_REGION29_LOW_V  0x000FFFFFU
#define PMS_DMA_REGION29_LOW_S  12

/** PMS_DMA_REGION29_HIGH_REG register
 *  Region29 end address configuration register
 */
#define PMS_DMA_REGION29_HIGH_REG (DR_REG_DMA_PMS_BASE + 0xf4)
/** PMS_DMA_REGION29_HIGH : R/W; bitpos: [31:12]; default: 1048575;
 *  Configures the high 20 bits of the end address for region29.
 */
#define PMS_DMA_REGION29_HIGH    0x000FFFFFU
#define PMS_DMA_REGION29_HIGH_M  (PMS_DMA_REGION29_HIGH_V << PMS_DMA_REGION29_HIGH_S)
#define PMS_DMA_REGION29_HIGH_V  0x000FFFFFU
#define PMS_DMA_REGION29_HIGH_S  12

/** PMS_DMA_REGION30_LOW_REG register
 *  Region30 start address configuration register
 */
#define PMS_DMA_REGION30_LOW_REG (DR_REG_DMA_PMS_BASE + 0xf8)
/** PMS_DMA_REGION30_LOW : R/W; bitpos: [31:12]; default: 0;
 *  Configures the high 20 bits of the start address for region30.
 */
#define PMS_DMA_REGION30_LOW    0x000FFFFFU
#define PMS_DMA_REGION30_LOW_M  (PMS_DMA_REGION30_LOW_V << PMS_DMA_REGION30_LOW_S)
#define PMS_DMA_REGION30_LOW_V  0x000FFFFFU
#define PMS_DMA_REGION30_LOW_S  12

