espressif/esp-idf/components/soc/esp32p4/register/hw_ver3/soc/dma_pms_reg.h
/** PMS_DMA_REGION30_HIGH_REG register
 *  Region30 end address configuration register
 */
#define PMS_DMA_REGION30_HIGH_REG (DR_REG_DMA_PMS_BASE + 0xfc)
/** PMS_DMA_REGION30_HIGH : R/W; bitpos: [31:12]; default: 1048575;
 *  Configures the high 20 bits of the end address for region30.
 */
#define PMS_DMA_REGION30_HIGH    0x000FFFFFU
#define PMS_DMA_REGION30_HIGH_M  (PMS_DMA_REGION30_HIGH_V << PMS_DMA_REGION30_HIGH_S)
#define PMS_DMA_REGION30_HIGH_V  0x000FFFFFU
#define PMS_DMA_REGION30_HIGH_S  12

/** PMS_DMA_REGION31_LOW_REG register
 *  Region31 start address configuration register
 */
#define PMS_DMA_REGION31_LOW_REG (DR_REG_DMA_PMS_BASE + 0x100)
/** PMS_DMA_REGION31_LOW : R/W; bitpos: [31:12]; default: 0;
 *  Configures the high 20 bits of the start address for region31.
 */
#define PMS_DMA_REGION31_LOW    0x000FFFFFU
#define PMS_DMA_REGION31_LOW_M  (PMS_DMA_REGION31_LOW_V << PMS_DMA_REGION31_LOW_S)
#define PMS_DMA_REGION31_LOW_V  0x000FFFFFU
#define PMS_DMA_REGION31_LOW_S  12

/** PMS_DMA_REGION31_HIGH_REG register
 *  Region31 end address configuration register
 */
#define PMS_DMA_REGION31_HIGH_REG (DR_REG_DMA_PMS_BASE + 0x104)
/** PMS_DMA_REGION31_HIGH : R/W; bitpos: [31:12]; default: 1048575;
 *  Configures the high 20 bits of the end address for region31.
 */
#define PMS_DMA_REGION31_HIGH    0x000FFFFFU
#define PMS_DMA_REGION31_HIGH_M  (PMS_DMA_REGION31_HIGH_V << PMS_DMA_REGION31_HIGH_S)
#define PMS_DMA_REGION31_HIGH_V  0x000FFFFFU
#define PMS_DMA_REGION31_HIGH_S  12

/** PMS_DMA_GDMA_CH0_R_PMS_REG register
 *  GDMA ch0 read permission control register
 */
#define PMS_DMA_GDMA_CH0_R_PMS_REG (DR_REG_DMA_PMS_BASE + 0x108)
/** PMS_DMA_GDMA_CH0_R_PMS : R/W; bitpos: [31:0]; default: 4294967295;
 *  Configures the permission for GDMA ch0 to read 32 address regions. Bit 0
 *  corresponds to region0, and so on.
 *  0: Disable read permission.
 *  1: Enable read permission.
 */
#define PMS_DMA_GDMA_CH0_R_PMS    0xFFFFFFFFU
#define PMS_DMA_GDMA_CH0_R_PMS_M  (PMS_DMA_GDMA_CH0_R_PMS_V << PMS_DMA_GDMA_CH0_R_PMS_S)
#define PMS_DMA_GDMA_CH0_R_PMS_V  0xFFFFFFFFU
#define PMS_DMA_GDMA_CH0_R_PMS_S  0

/** PMS_DMA_GDMA_CH0_W_PMS_REG register
 *  GDMA ch0 write permission control register
 */
#define PMS_DMA_GDMA_CH0_W_PMS_REG (DR_REG_DMA_PMS_BASE + 0x10c)
/** PMS_DMA_GDMA_CH0_W_PMS : R/W; bitpos: [31:0]; default: 4294967295;
 *  Configures the permission for GDMA ch0 to write 32 address regions. Bit 0
 *  corresponds to region0, and so on.
 *  0: Disable write permission.
 *  1: Enable write permission.
 */
#define PMS_DMA_GDMA_CH0_W_PMS    0xFFFFFFFFU
#define PMS_DMA_GDMA_CH0_W_PMS_M  (PMS_DMA_GDMA_CH0_W_PMS_V << PMS_DMA_GDMA_CH0_W_PMS_S)
#define PMS_DMA_GDMA_CH0_W_PMS_V  0xFFFFFFFFU
#define PMS_DMA_GDMA_CH0_W_PMS_S  0

/** PMS_DMA_GDMA_CH1_R_PMS_REG register
 *  GDMA ch1 read permission control register
 */
#define PMS_DMA_GDMA_CH1_R_PMS_REG (DR_REG_DMA_PMS_BASE + 0x110)
/** PMS_DMA_GDMA_CH1_R_PMS : R/W; bitpos: [31:0]; default: 4294967295;
 *  Configures the permission for GDMA ch1 to read 32 address regions. Bit 0
 *  corresponds to region0, and so on.
 *  0: Disable read permission.
 *  1: Enable read permission.
 */
#define PMS_DMA_GDMA_CH1_R_PMS    0xFFFFFFFFU
#define PMS_DMA_GDMA_CH1_R_PMS_M  (PMS_DMA_GDMA_CH1_R_PMS_V << PMS_DMA_GDMA_CH1_R_PMS_S)
#define PMS_DMA_GDMA_CH1_R_PMS_V  0xFFFFFFFFU
#define PMS_DMA_GDMA_CH1_R_PMS_S  0

/** PMS_DMA_GDMA_CH1_W_PMS_REG register
 *  GDMA ch1 write permission control register
 */
#define PMS_DMA_GDMA_CH1_W_PMS_REG (DR_REG_DMA_PMS_BASE + 0x114)
/** PMS_DMA_GDMA_CH1_W_PMS : R/W; bitpos: [31:0]; default: 4294967295;
 *  Configures the permission for GDMA ch1 to write 32 address regions. Bit 0
 *  corresponds to region0, and so on.
 *  0: Disable write permission.
 *  1: Enable write permission.
 */
#define PMS_DMA_GDMA_CH1_W_PMS    0xFFFFFFFFU
#define PMS_DMA_GDMA_CH1_W_PMS_M  (PMS_DMA_GDMA_CH1_W_PMS_V << PMS_DMA_GDMA_CH1_W_PMS_S)
#define PMS_DMA_GDMA_CH1_W_PMS_V  0xFFFFFFFFU
#define PMS_DMA_GDMA_CH1_W_PMS_S  0

/** PMS_DMA_GDMA_CH2_R_PMS_REG register
 *  GDMA ch2 read permission control register
 */
#define PMS_DMA_GDMA_CH2_R_PMS_REG (DR_REG_DMA_PMS_BASE + 0x118)
/** PMS_DMA_GDMA_CH2_R_PMS : R/W; bitpos: [31:0]; default: 4294967295;
 *  Configures the permission for GDMA ch2 to read 32 address regions. Bit 0
 *  corresponds to region0, and so on.
 *  0: Disable read permission.
 *  1: Enable read permission.
 */
#define PMS_DMA_GDMA_CH2_R_PMS    0xFFFFFFFFU
#define PMS_DMA_GDMA_CH2_R_PMS_M  (PMS_DMA_GDMA_CH2_R_PMS_V << PMS_DMA_GDMA_CH2_R_PMS_S)
#define PMS_DMA_GDMA_CH2_R_PMS_V  0xFFFFFFFFU
#define PMS_DMA_GDMA_CH2_R_PMS_S  0

/** PMS_DMA_GDMA_CH2_W_PMS_REG register
 *  GDMA ch2 write permission control register
 */
#define PMS_DMA_GDMA_CH2_W_PMS_REG (DR_REG_DMA_PMS_BASE + 0x11c)
/** PMS_DMA_GDMA_CH2_W_PMS : R/W; bitpos: [31:0]; default: 4294967295;
 *  Configures the permission for GDMA ch2 to write 32 address regions. Bit 0
 *  corresponds to region0, and so on.
 *  0: Disable write permission.
 *  1: Enable write permission.
 */
#define PMS_DMA_GDMA_CH2_W_PMS    0xFFFFFFFFU
#define PMS_DMA_GDMA_CH2_W_PMS_M  (PMS_DMA_GDMA_CH2_W_PMS_V << PMS_DMA_GDMA_CH2_W_PMS_S)
#define PMS_DMA_GDMA_CH2_W_PMS_V  0xFFFFFFFFU
#define PMS_DMA_GDMA_CH2_W_PMS_S  0

/** PMS_DMA_GDMA_CH3_R_PMS_REG register
 *  GDMA ch3 read permission control register
 */
#define PMS_DMA_GDMA_CH3_R_PMS_REG (DR_REG_DMA_PMS_BASE + 0x120)
/** PMS_DMA_GDMA_CH3_R_PMS : R/W; bitpos: [31:0]; default: 4294967295;
 *  Configures the permission for GDMA ch3 to read 32 address regions. Bit 0
 *  corresponds to region0, and so on.
 *  0: Disable read permission.
 *  1: Enable read permission.
 */
#define PMS_DMA_GDMA_CH3_R_PMS    0xFFFFFFFFU
#define PMS_DMA_GDMA_CH3_R_PMS_M  (PMS_DMA_GDMA_CH3_R_PMS_V << PMS_DMA_GDMA_CH3_R_PMS_S)
#define PMS_DMA_GDMA_CH3_R_PMS_V  0xFFFFFFFFU
#define PMS_DMA_GDMA_CH3_R_PMS_S  0

/** PMS_DMA_GDMA_CH3_W_PMS_REG register
 *  GDMA ch3 write permission control register
 */
#define PMS_DMA_GDMA_CH3_W_PMS_REG (DR_REG_DMA_PMS_BASE + 0x124)
/** PMS_DMA_GDMA_CH3_W_PMS : R/W; bitpos: [31:0]; default: 4294967295;
 *  Configures the permission for GDMA ch3 to write 32 address regions. Bit 0
 *  corresponds to region0, and so on.
 *  0: Disable write permission.
 *  1: Enable write permission.
 */
#define PMS_DMA_GDMA_CH3_W_PMS    0xFFFFFFFFU
#define PMS_DMA_GDMA_CH3_W_PMS_M  (PMS_DMA_GDMA_CH3_W_PMS_V << PMS_DMA_GDMA_CH3_W_PMS_S)
#define PMS_DMA_GDMA_CH3_W_PMS_V  0xFFFFFFFFU
#define PMS_DMA_GDMA_CH3_W_PMS_S  0

/** PMS_DMA_AHB_PDMA_ADC_R_PMS_REG register
 *  GDMA-AHB ADC read permission control register
 */
#define PMS_DMA_AHB_PDMA_ADC_R_PMS_REG (DR_REG_DMA_PMS_BASE + 0x128)
/** PMS_DMA_AHB_PDMA_ADC_R_PMS : R/W; bitpos: [31:0]; default: 4294967295;
 *  Configures GDMA-AHB permission to read 32 address ranges requested by ADC. Bit 0
 *  corresponds to region0, and so on.
 *  0: Disable read permission.
 *  1: Enable read permission.
 */
#define PMS_DMA_AHB_PDMA_ADC_R_PMS    0xFFFFFFFFU
#define PMS_DMA_AHB_PDMA_ADC_R_PMS_M  (PMS_DMA_AHB_PDMA_ADC_R_PMS_V << PMS_DMA_AHB_PDMA_ADC_R_PMS_S)
#define PMS_DMA_AHB_PDMA_ADC_R_PMS_V  0xFFFFFFFFU
#define PMS_DMA_AHB_PDMA_ADC_R_PMS_S  0

/** PMS_DMA_AHB_PDMA_ADC_W_PMS_REG register
 *  GDMA-AHB ADC write permission control register
 */
#define PMS_DMA_AHB_PDMA_ADC_W_PMS_REG (DR_REG_DMA_PMS_BASE + 0x12c)
/** PMS_DMA_AHB_PDMA_ADC_W_PMS : R/W; bitpos: [31:0]; default: 4294967295;
 *  Configures GDMA-AHB permission to write 32 address ranges requested by ADC. Bit 0
 *  corresponds to region0, and so on.
 *  0: Disable write permission.
 *  1: Enable write permission.
 */
#define PMS_DMA_AHB_PDMA_ADC_W_PMS    0xFFFFFFFFU
#define PMS_DMA_AHB_PDMA_ADC_W_PMS_M  (PMS_DMA_AHB_PDMA_ADC_W_PMS_V << PMS_DMA_AHB_PDMA_ADC_W_PMS_S)
#define PMS_DMA_AHB_PDMA_ADC_W_PMS_V  0xFFFFFFFFU
#define PMS_DMA_AHB_PDMA_ADC_W_PMS_S  0

/** PMS_DMA_AHB_PDMA_I2S0_R_PMS_REG register
 *  GDMA-AHB I2S0 read permission control register
 */
#define PMS_DMA_AHB_PDMA_I2S0_R_PMS_REG (DR_REG_DMA_PMS_BASE + 0x130)
/** PMS_DMA_AHB_PDMA_I2S0_R_PMS : R/W; bitpos: [31:0]; default: 4294967295;
 *  Configures GDMA-AHB permission to read 32 address ranges requested by I2S0. Bit 0
 *  corresponds to region0, and so on.
 *  0: Disable read permission.
 *  1: Enable read permission.
 */
#define PMS_DMA_AHB_PDMA_I2S0_R_PMS    0xFFFFFFFFU
#define PMS_DMA_AHB_PDMA_I2S0_R_PMS_M  (PMS_DMA_AHB_PDMA_I2S0_R_PMS_V << PMS_DMA_AHB_PDMA_I2S0_R_PMS_S)
#define PMS_DMA_AHB_PDMA_I2S0_R_PMS_V  0xFFFFFFFFU
#define PMS_DMA_AHB_PDMA_I2S0_R_PMS_S  0

/** PMS_DMA_AHB_PDMA_I2S0_W_PMS_REG register
 *  GDMA-AHB I2S0 write permission control register
 */
#define PMS_DMA_AHB_PDMA_I2S0_W_PMS_REG (DR_REG_DMA_PMS_BASE + 0x134)
/** PMS_DMA_AHB_PDMA_I2S0_W_PMS : R/W; bitpos: [31:0]; default: 4294967295;
 *  Configures GDMA-AHB permission to write 32 address ranges requested by I2S0. Bit 0
 *  corresponds to region0, and so on.
 *  0: Disable write permission.
 *  1: Enable write permission.
 */
#define PMS_DMA_AHB_PDMA_I2S0_W_PMS    0xFFFFFFFFU
#define PMS_DMA_AHB_PDMA_I2S0_W_PMS_M  (PMS_DMA_AHB_PDMA_I2S0_W_PMS_V << PMS_DMA_AHB_PDMA_I2S0_W_PMS_S)
#define PMS_DMA_AHB_PDMA_I2S0_W_PMS_V  0xFFFFFFFFU
#define PMS_DMA_AHB_PDMA_I2S0_W_PMS_S  0

/** PMS_DMA_AHB_PDMA_I2S1_R_PMS_REG register
 *  GDMA-AHB I2S1 read permission control register
 */
#define PMS_DMA_AHB_PDMA_I2S1_R_PMS_REG (DR_REG_DMA_PMS_BASE + 0x138)
/** PMS_DMA_AHB_PDMA_I2S1_R_PMS : R/W; bitpos: [31:0]; default: 4294967295;
 *  Configures GDMA-AHB permission to read 32 address ranges requested by I2S1. Bit 0
 *  corresponds to region0, and so on.
 *  0: Disable read permission.
 *  1: Enable read permission.
 */
#define PMS_DMA_AHB_PDMA_I2S1_R_PMS    0xFFFFFFFFU
#define PMS_DMA_AHB_PDMA_I2S1_R_PMS_M  (PMS_DMA_AHB_PDMA_I2S1_R_PMS_V << PMS_DMA_AHB_PDMA_I2S1_R_PMS_S)
#define PMS_DMA_AHB_PDMA_I2S1_R_PMS_V  0xFFFFFFFFU
#define PMS_DMA_AHB_PDMA_I2S1_R_PMS_S  0

