espressif/esp-idf/components/soc/esp32p4/register/hw_ver3/soc/dma_pms_reg.h
/** PMS_DMA_AXI_PDMA_GPSPI2_W_PMS_REG register
 *  GDMA-AXI GPSPI2 write permission control register
 */
#define PMS_DMA_AXI_PDMA_GPSPI2_W_PMS_REG (DR_REG_DMA_PMS_BASE + 0x180)
/** PMS_DMA_AXI_PDMA_GPSPI2_W_PMS : R/W; bitpos: [31:0]; default: 4294967295;
 *  Configures GDMA-AXI permission to write 32 address ranges requested by GP-SPI2. Bit
 *  0 corresponds to region0, and so on.
 *  0: Disable write permission.
 *  1: Enable write permission.
 */
#define PMS_DMA_AXI_PDMA_GPSPI2_W_PMS    0xFFFFFFFFU
#define PMS_DMA_AXI_PDMA_GPSPI2_W_PMS_M  (PMS_DMA_AXI_PDMA_GPSPI2_W_PMS_V << PMS_DMA_AXI_PDMA_GPSPI2_W_PMS_S)
#define PMS_DMA_AXI_PDMA_GPSPI2_W_PMS_V  0xFFFFFFFFU
#define PMS_DMA_AXI_PDMA_GPSPI2_W_PMS_S  0

/** PMS_DMA_AXI_PDMA_GPSPI3_R_PMS_REG register
 *  GDMA-AXI GPSPI3 read permission control register
 */
#define PMS_DMA_AXI_PDMA_GPSPI3_R_PMS_REG (DR_REG_DMA_PMS_BASE + 0x184)
/** PMS_DMA_AXI_PDMA_GPSPI3_R_PMS : R/W; bitpos: [31:0]; default: 4294967295;
 *  Configures GDMA-AXI permission to read 32 address ranges requested by GP-SPI3. Bit
 *  0 corresponds to region0, and so on.
 *  0: Disable read permission.
 *  1: Enable read permission.
 */
#define PMS_DMA_AXI_PDMA_GPSPI3_R_PMS    0xFFFFFFFFU
#define PMS_DMA_AXI_PDMA_GPSPI3_R_PMS_M  (PMS_DMA_AXI_PDMA_GPSPI3_R_PMS_V << PMS_DMA_AXI_PDMA_GPSPI3_R_PMS_S)
#define PMS_DMA_AXI_PDMA_GPSPI3_R_PMS_V  0xFFFFFFFFU
#define PMS_DMA_AXI_PDMA_GPSPI3_R_PMS_S  0

/** PMS_DMA_AXI_PDMA_GPSPI3_W_PMS_REG register
 *  AXI PDMA GPSPI3 write permission control register
 */
#define PMS_DMA_AXI_PDMA_GPSPI3_W_PMS_REG (DR_REG_DMA_PMS_BASE + 0x188)
/** PMS_DMA_AXI_PDMA_GPSPI3_W_PMS : R/W; bitpos: [31:0]; default: 4294967295;
 *  Configures GDMA-AXI permission to write 32 address ranges requested by GP-SPI3. Bit
 *  0 corresponds to region0, and so on.
 *  0: Disable write permission.
 *  1: Enable write permission.
 */
#define PMS_DMA_AXI_PDMA_GPSPI3_W_PMS    0xFFFFFFFFU
#define PMS_DMA_AXI_PDMA_GPSPI3_W_PMS_M  (PMS_DMA_AXI_PDMA_GPSPI3_W_PMS_V << PMS_DMA_AXI_PDMA_GPSPI3_W_PMS_S)
#define PMS_DMA_AXI_PDMA_GPSPI3_W_PMS_V  0xFFFFFFFFU
#define PMS_DMA_AXI_PDMA_GPSPI3_W_PMS_S  0

/** PMS_DMA_AXI_PDMA_PARLIO_R_PMS_REG register
 *  GDMA-AXI PARLIO read permission control register
 */
#define PMS_DMA_AXI_PDMA_PARLIO_R_PMS_REG (DR_REG_DMA_PMS_BASE + 0x18c)
/** PMS_DMA_AXI_PDMA_PARLIO_R_PMS : R/W; bitpos: [31:0]; default: 4294967295;
 *  Configures GDMA-AXI permission to read 32 address ranges requested by PARLIO
 *  (Parallel IO Controller). Bit 0 corresponds to region0, and so on.
 *  0: Disable read permission.
 *  1: Enable read permission.
 */
#define PMS_DMA_AXI_PDMA_PARLIO_R_PMS    0xFFFFFFFFU
#define PMS_DMA_AXI_PDMA_PARLIO_R_PMS_M  (PMS_DMA_AXI_PDMA_PARLIO_R_PMS_V << PMS_DMA_AXI_PDMA_PARLIO_R_PMS_S)
#define PMS_DMA_AXI_PDMA_PARLIO_R_PMS_V  0xFFFFFFFFU
#define PMS_DMA_AXI_PDMA_PARLIO_R_PMS_S  0

/** PMS_DMA_AXI_PDMA_PARLIO_W_PMS_REG register
 *  GDMA-AXI PARLIO write permission control register
 */
#define PMS_DMA_AXI_PDMA_PARLIO_W_PMS_REG (DR_REG_DMA_PMS_BASE + 0x190)
/** PMS_DMA_AXI_PDMA_PARLIO_W_PMS : R/W; bitpos: [31:0]; default: 4294967295;
 *  Configures GDMA-AXI permission to write 32 address ranges requested by PARLIO. Bit
 *  0 corresponds to region0, and so on.
 *  0: Disable write permission.
 *  1: Enable write permission.
 */
#define PMS_DMA_AXI_PDMA_PARLIO_W_PMS    0xFFFFFFFFU
#define PMS_DMA_AXI_PDMA_PARLIO_W_PMS_M  (PMS_DMA_AXI_PDMA_PARLIO_W_PMS_V << PMS_DMA_AXI_PDMA_PARLIO_W_PMS_S)
#define PMS_DMA_AXI_PDMA_PARLIO_W_PMS_V  0xFFFFFFFFU
#define PMS_DMA_AXI_PDMA_PARLIO_W_PMS_S  0

/** PMS_DMA_AXI_PDMA_AES_R_PMS_REG register
 *  GDMA-AXI AES read permission control register
 */
#define PMS_DMA_AXI_PDMA_AES_R_PMS_REG (DR_REG_DMA_PMS_BASE + 0x194)
/** PMS_DMA_AXI_PDMA_AES_R_PMS : R/W; bitpos: [31:0]; default: 4294967295;
 *  Configures GDMA-AXI permission to read 32 address ranges requested by AES. Bit 0
 *  corresponds to region0, and so on.
 *  0: Disable read permission.
 *  1: Enable read permission.
 */
#define PMS_DMA_AXI_PDMA_AES_R_PMS    0xFFFFFFFFU
#define PMS_DMA_AXI_PDMA_AES_R_PMS_M  (PMS_DMA_AXI_PDMA_AES_R_PMS_V << PMS_DMA_AXI_PDMA_AES_R_PMS_S)
#define PMS_DMA_AXI_PDMA_AES_R_PMS_V  0xFFFFFFFFU
#define PMS_DMA_AXI_PDMA_AES_R_PMS_S  0

/** PMS_DMA_AXI_PDMA_AES_W_PMS_REG register
 *  GDMA-AXI AES write permission control register
 */
#define PMS_DMA_AXI_PDMA_AES_W_PMS_REG (DR_REG_DMA_PMS_BASE + 0x198)
/** PMS_DMA_AXI_PDMA_AES_W_PMS : R/W; bitpos: [31:0]; default: 4294967295;
 *  Configures GDMA-AXI permission to write 32 address ranges requested by AES. Bit 0
 *  corresponds to region0, and so on.
 *  0: Disable write permission.
 *  1: Enable write permission.
 */
#define PMS_DMA_AXI_PDMA_AES_W_PMS    0xFFFFFFFFU
#define PMS_DMA_AXI_PDMA_AES_W_PMS_M  (PMS_DMA_AXI_PDMA_AES_W_PMS_V << PMS_DMA_AXI_PDMA_AES_W_PMS_S)
#define PMS_DMA_AXI_PDMA_AES_W_PMS_V  0xFFFFFFFFU
#define PMS_DMA_AXI_PDMA_AES_W_PMS_S  0

/** PMS_DMA_AXI_PDMA_SHA_R_PMS_REG register
 *  GDMA-AXI SHA read permission control register
 */
#define PMS_DMA_AXI_PDMA_SHA_R_PMS_REG (DR_REG_DMA_PMS_BASE + 0x19c)
/** PMS_DMA_AXI_PDMA_SHA_R_PMS : R/W; bitpos: [31:0]; default: 4294967295;
 *  Configures GDMA-AXI permission to read 32 address ranges requested by SHA. Bit 0
 *  corresponds to region0, and so on.
 *  0: Disable read permission.
 *  1: Enable read permission.
 */
#define PMS_DMA_AXI_PDMA_SHA_R_PMS    0xFFFFFFFFU
#define PMS_DMA_AXI_PDMA_SHA_R_PMS_M  (PMS_DMA_AXI_PDMA_SHA_R_PMS_V << PMS_DMA_AXI_PDMA_SHA_R_PMS_S)
#define PMS_DMA_AXI_PDMA_SHA_R_PMS_V  0xFFFFFFFFU
#define PMS_DMA_AXI_PDMA_SHA_R_PMS_S  0

/** PMS_DMA_AXI_PDMA_SHA_W_PMS_REG register
 *  GDMA-AXI SHA write permission control register
 */
#define PMS_DMA_AXI_PDMA_SHA_W_PMS_REG (DR_REG_DMA_PMS_BASE + 0x1a0)
/** PMS_DMA_AXI_PDMA_SHA_W_PMS : R/W; bitpos: [31:0]; default: 4294967295;
 *  Configures GDMA-AXI permission to write 32 address ranges requested by SHA. Bit 0
 *  corresponds to region0, and so on.
 *  0: Disable write permission.
 *  1: Enable write permission.
 */
#define PMS_DMA_AXI_PDMA_SHA_W_PMS    0xFFFFFFFFU
#define PMS_DMA_AXI_PDMA_SHA_W_PMS_M  (PMS_DMA_AXI_PDMA_SHA_W_PMS_V << PMS_DMA_AXI_PDMA_SHA_W_PMS_S)
#define PMS_DMA_AXI_PDMA_SHA_W_PMS_V  0xFFFFFFFFU
#define PMS_DMA_AXI_PDMA_SHA_W_PMS_S  0

/** PMS_DMA_DMA2D_JPEG_PMS_R_REG register
 *  2D-DMA JPEG read permission control register
 */
#define PMS_DMA_DMA2D_JPEG_PMS_R_REG (DR_REG_DMA_PMS_BASE + 0x1a4)
/** PMS_DMA_DMA2D_JPEG_R_PMS : R/W; bitpos: [31:0]; default: 4294967295;
 *  Configures 2D-DMA permission to read 32 address ranges requested by JPEG. Bit 0
 *  corresponds to region0, and so on.
 *  0: Disable read permission.
 *  1: Enable read permission.
 */
#define PMS_DMA_DMA2D_JPEG_R_PMS    0xFFFFFFFFU
#define PMS_DMA_DMA2D_JPEG_R_PMS_M  (PMS_DMA_DMA2D_JPEG_R_PMS_V << PMS_DMA_DMA2D_JPEG_R_PMS_S)
#define PMS_DMA_DMA2D_JPEG_R_PMS_V  0xFFFFFFFFU
#define PMS_DMA_DMA2D_JPEG_R_PMS_S  0

/** PMS_DMA_DMA2D_JPEG_PMS_W_REG register
 *  2D-DMA JPEG write permission control register
 */
#define PMS_DMA_DMA2D_JPEG_PMS_W_REG (DR_REG_DMA_PMS_BASE + 0x1a8)
/** PMS_DMA_DMA2D_JPEG_W_PMS : R/W; bitpos: [31:0]; default: 4294967295;
 *  Configures 2D-DMA permission to write 32 address ranges requested by JPEG. Bit 0
 *  corresponds to region0, and so on.
 *  0: Disable write permission.
 *  1: Enable write permission.
 */
#define PMS_DMA_DMA2D_JPEG_W_PMS    0xFFFFFFFFU
#define PMS_DMA_DMA2D_JPEG_W_PMS_M  (PMS_DMA_DMA2D_JPEG_W_PMS_V << PMS_DMA_DMA2D_JPEG_W_PMS_S)
#define PMS_DMA_DMA2D_JPEG_W_PMS_V  0xFFFFFFFFU
#define PMS_DMA_DMA2D_JPEG_W_PMS_S  0

/** PMS_DMA_USB_PMS_R_REG register
 *  High-speed USB 2.0 OTG read permission control register
 */
#define PMS_DMA_USB_PMS_R_REG (DR_REG_DMA_PMS_BASE + 0x1ac)
/** PMS_DMA_USB_R_PMS : R/W; bitpos: [31:0]; default: 4294967295;
 *  Configures read permission for high-speed USB 2.0 OTG to access 32 address ranges.
 *  Bit 0 corresponds to region0, and so on.
 *  0: Disable read permission.
 *  1: Enable read permission.
 */
#define PMS_DMA_USB_R_PMS    0xFFFFFFFFU
#define PMS_DMA_USB_R_PMS_M  (PMS_DMA_USB_R_PMS_V << PMS_DMA_USB_R_PMS_S)
#define PMS_DMA_USB_R_PMS_V  0xFFFFFFFFU
#define PMS_DMA_USB_R_PMS_S  0

/** PMS_DMA_USB_PMS_W_REG register
 *  High-speed USB 2.0 OTG write permission control register
 */
#define PMS_DMA_USB_PMS_W_REG (DR_REG_DMA_PMS_BASE + 0x1b0)
/** PMS_DMA_USB_W_PMS : R/W; bitpos: [31:0]; default: 4294967295;
 *  Configures write permission for high-speed USB 2.0 OTG to access 32 address ranges.
 *  Bit 0 corresponds to region0, and so on.
 *  0: Disable write permission.
 *  1: Enable write permission.
 */
#define PMS_DMA_USB_W_PMS    0xFFFFFFFFU
#define PMS_DMA_USB_W_PMS_M  (PMS_DMA_USB_W_PMS_V << PMS_DMA_USB_W_PMS_S)
#define PMS_DMA_USB_W_PMS_V  0xFFFFFFFFU
#define PMS_DMA_USB_W_PMS_S  0

/** PMS_DMA_GMAC_PMS_R_REG register
 *  EMAC read permission control register
 */
#define PMS_DMA_GMAC_PMS_R_REG (DR_REG_DMA_PMS_BASE + 0x1b4)
/** PMS_DMA_GMAC_R_PMS : R/W; bitpos: [31:0]; default: 4294967295;
 *  Configures read permission for EMAC to access 32 address ranges. Bit 0 corresponds
 *  to region0, and so on.
 *  0: Disable read permission.
 *  1: Enable read permission.
 */
#define PMS_DMA_GMAC_R_PMS    0xFFFFFFFFU
#define PMS_DMA_GMAC_R_PMS_M  (PMS_DMA_GMAC_R_PMS_V << PMS_DMA_GMAC_R_PMS_S)
#define PMS_DMA_GMAC_R_PMS_V  0xFFFFFFFFU
#define PMS_DMA_GMAC_R_PMS_S  0

/** PMS_DMA_GMAC_PMS_W_REG register
 *  EMAC write permission control register
 */
#define PMS_DMA_GMAC_PMS_W_REG (DR_REG_DMA_PMS_BASE + 0x1b8)
/** PMS_DMA_GMAC_W_PMS : R/W; bitpos: [31:0]; default: 4294967295;
 *  Configures write permission for EMAC to access 32 address ranges. Bit 0 corresponds
 *  to region0, and so on.
 *  0: Disable write permission.
 *  1: Enable write permission.
 */
#define PMS_DMA_GMAC_W_PMS    0xFFFFFFFFU
#define PMS_DMA_GMAC_W_PMS_M  (PMS_DMA_GMAC_W_PMS_V << PMS_DMA_GMAC_W_PMS_S)
#define PMS_DMA_GMAC_W_PMS_V  0xFFFFFFFFU
#define PMS_DMA_GMAC_W_PMS_S  0

