espressif/esp-idf/components/soc/esp32p4/register/hw_ver3/soc/dma_pms_reg.h
/** PMS_DMA_SDMMC_PMS_R_REG register
 *  SDMMC read permission control register
 */
#define PMS_DMA_SDMMC_PMS_R_REG (DR_REG_DMA_PMS_BASE + 0x1bc)
/** PMS_DMA_SDMMC_R_PMS : R/W; bitpos: [31:0]; default: 4294967295;
 *  Configures read permission for SDMMC to access 32 address ranges. Bit 0 corresponds
 *  to region0, and so on.
 *  0: Disable read permission.
 *  1: Enable read permission.
 */
#define PMS_DMA_SDMMC_R_PMS    0xFFFFFFFFU
#define PMS_DMA_SDMMC_R_PMS_M  (PMS_DMA_SDMMC_R_PMS_V << PMS_DMA_SDMMC_R_PMS_S)
#define PMS_DMA_SDMMC_R_PMS_V  0xFFFFFFFFU
#define PMS_DMA_SDMMC_R_PMS_S  0

/** PMS_DMA_SDMMC_PMS_W_REG register
 *  SDMMC write permission control register
 */
#define PMS_DMA_SDMMC_PMS_W_REG (DR_REG_DMA_PMS_BASE + 0x1c0)
/** PMS_DMA_SDMMC_W_PMS : R/W; bitpos: [31:0]; default: 4294967295;
 *  Configures write permission for SDMMC to access 32 address ranges. Bit 0
 *  corresponds to region0, and so on.
 *  0: Disable write permission.
 *  1: Enable write permission.
 */
#define PMS_DMA_SDMMC_W_PMS    0xFFFFFFFFU
#define PMS_DMA_SDMMC_W_PMS_M  (PMS_DMA_SDMMC_W_PMS_V << PMS_DMA_SDMMC_W_PMS_S)
#define PMS_DMA_SDMMC_W_PMS_V  0xFFFFFFFFU
#define PMS_DMA_SDMMC_W_PMS_S  0

/** PMS_DMA_USBOTG11_PMS_R_REG register
 *  Full-speed USB 2.0 OTG full-speed read permission control register
 */
#define PMS_DMA_USBOTG11_PMS_R_REG (DR_REG_DMA_PMS_BASE + 0x1c4)
/** PMS_DMA_USBOTG11_R_PMS : R/W; bitpos: [31:0]; default: 4294967295;
 *  Configures read permission for full-speed USB 2.0 OTG to access 32 address ranges.
 *  Bit 0 corresponds to region0, and so on.
 *  0: Disable read permission.
 *  1: Enable read permission.
 */
#define PMS_DMA_USBOTG11_R_PMS    0xFFFFFFFFU
#define PMS_DMA_USBOTG11_R_PMS_M  (PMS_DMA_USBOTG11_R_PMS_V << PMS_DMA_USBOTG11_R_PMS_S)
#define PMS_DMA_USBOTG11_R_PMS_V  0xFFFFFFFFU
#define PMS_DMA_USBOTG11_R_PMS_S  0

/** PMS_DMA_USBOTG11_PMS_W_REG register
 *  Full-speed USB 2.0 OTG full-speed write permission control register
 */
#define PMS_DMA_USBOTG11_PMS_W_REG (DR_REG_DMA_PMS_BASE + 0x1c8)
/** PMS_DMA_USBOTG11_W_PMS : R/W; bitpos: [31:0]; default: 4294967295;
 *  Configures write permission for full-speed USB 2.0 OTG to access 32 address ranges.
 *  Bit 0 corresponds to region0, and so on.
 *  0: Disable write permission.
 *  1: Enable write permission.
 */
#define PMS_DMA_USBOTG11_W_PMS    0xFFFFFFFFU
#define PMS_DMA_USBOTG11_W_PMS_M  (PMS_DMA_USBOTG11_W_PMS_V << PMS_DMA_USBOTG11_W_PMS_S)
#define PMS_DMA_USBOTG11_W_PMS_V  0xFFFFFFFFU
#define PMS_DMA_USBOTG11_W_PMS_S  0

/** PMS_DMA_TRACE0_PMS_R_REG register
 *  TRACE0 read permission control register
 */
#define PMS_DMA_TRACE0_PMS_R_REG (DR_REG_DMA_PMS_BASE + 0x1cc)
/** PMS_DMA_TRACE0_R_PMS : R/W; bitpos: [31:0]; default: 4294967295;
 *  Configures read permission for TRACE0 to access 32 address ranges. Bit 0
 *  corresponds to region0, and so on.
 *  0: Disable read permission.
 *  1: Enable read permission.
 */
#define PMS_DMA_TRACE0_R_PMS    0xFFFFFFFFU
#define PMS_DMA_TRACE0_R_PMS_M  (PMS_DMA_TRACE0_R_PMS_V << PMS_DMA_TRACE0_R_PMS_S)
#define PMS_DMA_TRACE0_R_PMS_V  0xFFFFFFFFU
#define PMS_DMA_TRACE0_R_PMS_S  0

/** PMS_DMA_TRACE0_PMS_W_REG register
 *  TRACE0 write permission control register
 */
#define PMS_DMA_TRACE0_PMS_W_REG (DR_REG_DMA_PMS_BASE + 0x1d0)
/** PMS_DMA_TRACE0_W_PMS : R/W; bitpos: [31:0]; default: 4294967295;
 *  Configures write permission for TRACE0 to access 32 address ranges. Bit 0
 *  corresponds to region0, and so on.
 *  0: Disable write permission.
 *  1: Enable write permission.
 */
#define PMS_DMA_TRACE0_W_PMS    0xFFFFFFFFU
#define PMS_DMA_TRACE0_W_PMS_M  (PMS_DMA_TRACE0_W_PMS_V << PMS_DMA_TRACE0_W_PMS_S)
#define PMS_DMA_TRACE0_W_PMS_V  0xFFFFFFFFU
#define PMS_DMA_TRACE0_W_PMS_S  0

/** PMS_DMA_TRACE1_PMS_R_REG register
 *  TRACE1 read permission control register
 */
#define PMS_DMA_TRACE1_PMS_R_REG (DR_REG_DMA_PMS_BASE + 0x1d4)
/** PMS_DMA_TRACE1_R_PMS : R/W; bitpos: [31:0]; default: 4294967295;
 *  Configures read permission for TRACE1 to access 32 address ranges. Bit 0
 *  corresponds to region0, and so on.
 *  0: Disable read permission.
 *  1: Enable read permission.
 */
#define PMS_DMA_TRACE1_R_PMS    0xFFFFFFFFU
#define PMS_DMA_TRACE1_R_PMS_M  (PMS_DMA_TRACE1_R_PMS_V << PMS_DMA_TRACE1_R_PMS_S)
#define PMS_DMA_TRACE1_R_PMS_V  0xFFFFFFFFU
#define PMS_DMA_TRACE1_R_PMS_S  0

/** PMS_DMA_TRACE1_PMS_W_REG register
 *  TRACE1 write permission control register
 */
#define PMS_DMA_TRACE1_PMS_W_REG (DR_REG_DMA_PMS_BASE + 0x1d8)
/** PMS_DMA_TRACE1_W_PMS : R/W; bitpos: [31:0]; default: 4294967295;
 *  Configures write permission for TRACE1 to access 32 address ranges. Bit 0
 *  corresponds to region0, and so on.
 *  0: Disable write permission.
 *  1: Enable write permission.
 */
#define PMS_DMA_TRACE1_W_PMS    0xFFFFFFFFU
#define PMS_DMA_TRACE1_W_PMS_M  (PMS_DMA_TRACE1_W_PMS_V << PMS_DMA_TRACE1_W_PMS_S)
#define PMS_DMA_TRACE1_W_PMS_V  0xFFFFFFFFU
#define PMS_DMA_TRACE1_W_PMS_S  0

/** PMS_DMA_L2MEM_MON_PMS_R_REG register
 *  L2MEM Monitor read permission control register
 */
#define PMS_DMA_L2MEM_MON_PMS_R_REG (DR_REG_DMA_PMS_BASE + 0x1dc)
/** PMS_DMA_L2MEM_MON_R_PMS : R/W; bitpos: [31:0]; default: 4294967295;
 *  Configures read permission for L2MEM MON. Each bit corresponds to a region. Bit 0
 *  corresponds to region0, and so on.
 *  0: Disable read permission.
 *  1: Enable read permission.
 */
#define PMS_DMA_L2MEM_MON_R_PMS    0xFFFFFFFFU
#define PMS_DMA_L2MEM_MON_R_PMS_M  (PMS_DMA_L2MEM_MON_R_PMS_V << PMS_DMA_L2MEM_MON_R_PMS_S)
#define PMS_DMA_L2MEM_MON_R_PMS_V  0xFFFFFFFFU
#define PMS_DMA_L2MEM_MON_R_PMS_S  0

/** PMS_DMA_L2MEM_MON_PMS_W_REG register
 *  L2MEM Monitor write permission control register
 */
#define PMS_DMA_L2MEM_MON_PMS_W_REG (DR_REG_DMA_PMS_BASE + 0x1e0)
/** PMS_DMA_L2MEM_MON_W_PMS : R/W; bitpos: [31:0]; default: 4294967295;
 *  Configures write permission for L2MEM monitor to access 32 address ranges. Bit 0
 *  corresponds to region0, and so on.
 *  0: Disable write permission.
 *  1: Enable write permission.
 */
#define PMS_DMA_L2MEM_MON_W_PMS    0xFFFFFFFFU
#define PMS_DMA_L2MEM_MON_W_PMS_M  (PMS_DMA_L2MEM_MON_W_PMS_V << PMS_DMA_L2MEM_MON_W_PMS_S)
#define PMS_DMA_L2MEM_MON_W_PMS_V  0xFFFFFFFFU
#define PMS_DMA_L2MEM_MON_W_PMS_S  0

/** PMS_DMA_SPM_MON_PMS_R_REG register
 *  SPM Monitor read permission control register
 */
#define PMS_DMA_SPM_MON_PMS_R_REG (DR_REG_DMA_PMS_BASE + 0x1e4)
/** PMS_DMA_SPM_MON_R_PMS : R/W; bitpos: [31:0]; default: 4294967295;
 *  Configures read permission for SPM MON. Each bit corresponds to a region. Bit 0
 *  corresponds to region0, and so on.
 *  0: Disable read permission.
 *  1: Enable read permission.
 */
#define PMS_DMA_SPM_MON_R_PMS    0xFFFFFFFFU
#define PMS_DMA_SPM_MON_R_PMS_M  (PMS_DMA_SPM_MON_R_PMS_V << PMS_DMA_SPM_MON_R_PMS_S)
#define PMS_DMA_SPM_MON_R_PMS_V  0xFFFFFFFFU
#define PMS_DMA_SPM_MON_R_PMS_S  0

/** PMS_DMA_SPM_MON_PMS_W_REG register
 *  SPM Monitor write permission control register
 */
#define PMS_DMA_SPM_MON_PMS_W_REG (DR_REG_DMA_PMS_BASE + 0x1e8)
/** PMS_DMA_SPM_MON_W_PMS : R/W; bitpos: [31:0]; default: 4294967295;
 *  Configures write permission for SPM monitor to access 32 address ranges. Bit 0
 *  corresponds to region0, and so on.
 *  0: Disable write permission.
 *  1: Enable write permission.
 */
#define PMS_DMA_SPM_MON_W_PMS    0xFFFFFFFFU
#define PMS_DMA_SPM_MON_W_PMS_M  (PMS_DMA_SPM_MON_W_PMS_V << PMS_DMA_SPM_MON_W_PMS_S)
#define PMS_DMA_SPM_MON_W_PMS_V  0xFFFFFFFFU
#define PMS_DMA_SPM_MON_W_PMS_S  0

