espressif/esp-idf/components/soc/esp32p4/register/hw_ver3/soc/dma_pms_reg.h
/** PMS_DMA_REGDMA_PMS_R_REG register
 *  REGDMA read permission control registers.
 */
#define PMS_DMA_REGDMA_PMS_R_REG (DR_REG_DMA_PMS_BASE + 0x1ec)
/** PMS_DMA_REGDMA_R_PMS : R/W; bitpos: [31:0]; default: 4294967295;
 *  REGDMA read permission control, each bit corresponds to a region.
 */
#define PMS_DMA_REGDMA_R_PMS    0xFFFFFFFFU
#define PMS_DMA_REGDMA_R_PMS_M  (PMS_DMA_REGDMA_R_PMS_V << PMS_DMA_REGDMA_R_PMS_S)
#define PMS_DMA_REGDMA_R_PMS_V  0xFFFFFFFFU
#define PMS_DMA_REGDMA_R_PMS_S  0

/** PMS_DMA_REGDMA_PMS_W_REG register
 *  REGDMA write permission control registers.
 */
#define PMS_DMA_REGDMA_PMS_W_REG (DR_REG_DMA_PMS_BASE + 0x1f0)
/** PMS_DMA_REGDMA_W_PMS : R/W; bitpos: [31:0]; default: 4294967295;
 *  REGDMA write permission control, each bit corresponds to a region.
 */
#define PMS_DMA_REGDMA_W_PMS    0xFFFFFFFFU
#define PMS_DMA_REGDMA_W_PMS_M  (PMS_DMA_REGDMA_W_PMS_V << PMS_DMA_REGDMA_W_PMS_S)
#define PMS_DMA_REGDMA_W_PMS_V  0xFFFFFFFFU
#define PMS_DMA_REGDMA_W_PMS_S  0

/** PMS_DMA_H264_PMS_R_REG register
 *  H264 DMA read permission control register
 */
#define PMS_DMA_H264_PMS_R_REG (DR_REG_DMA_PMS_BASE + 0x1fc)
/** PMS_DMA_H264_R_PMS : R/W; bitpos: [31:0]; default: 4294967295;
 *  Configures read permission for H264 DMA to access 32 address ranges. Bit 0
 *  corresponds to region0, and so on.
 *  0: Disable read permission.
 *  1: Enable read permission.
 */
#define PMS_DMA_H264_R_PMS    0xFFFFFFFFU
#define PMS_DMA_H264_R_PMS_M  (PMS_DMA_H264_R_PMS_V << PMS_DMA_H264_R_PMS_S)
#define PMS_DMA_H264_R_PMS_V  0xFFFFFFFFU
#define PMS_DMA_H264_R_PMS_S  0

/** PMS_DMA_H264_PMS_W_REG register
 *  H264 DMA write permission control register
 */
#define PMS_DMA_H264_PMS_W_REG (DR_REG_DMA_PMS_BASE + 0x200)
/** PMS_DMA_H264_W_PMS : R/W; bitpos: [31:0]; default: 4294967295;
 *  Configures write permission for H264 DMA to access 32 address ranges. Bit 0
 *  corresponds to region0, and so on.
 *  0: Disable write permission.
 *  1: Enable write permission.
 */
#define PMS_DMA_H264_W_PMS    0xFFFFFFFFU
#define PMS_DMA_H264_W_PMS_M  (PMS_DMA_H264_W_PMS_V << PMS_DMA_H264_W_PMS_S)
#define PMS_DMA_H264_W_PMS_V  0xFFFFFFFFU
#define PMS_DMA_H264_W_PMS_S  0

/** PMS_DMA_DMA2D_PPA_PMS_R_REG register
 *  2D-DMA PPA read permission control register
 */
#define PMS_DMA_DMA2D_PPA_PMS_R_REG (DR_REG_DMA_PMS_BASE + 0x204)
/** PMS_DMA_DMA2D_PPA_R_PMS : R/W; bitpos: [31:0]; default: 4294967295;
 *  Configures 2D-DMA permission to read 32 address ranges requested by PPA
 *  (Pixel-Processing Accelerator). Bit 0 corresponds to region0, and so on.
 *  0: Disable read permission.
 *  1: Enable read permission.
 */
#define PMS_DMA_DMA2D_PPA_R_PMS    0xFFFFFFFFU
#define PMS_DMA_DMA2D_PPA_R_PMS_M  (PMS_DMA_DMA2D_PPA_R_PMS_V << PMS_DMA_DMA2D_PPA_R_PMS_S)
#define PMS_DMA_DMA2D_PPA_R_PMS_V  0xFFFFFFFFU
#define PMS_DMA_DMA2D_PPA_R_PMS_S  0

/** PMS_DMA_DMA2D_PPA_PMS_W_REG register
 *  2D-DMA PPA write permission control register
 */
#define PMS_DMA_DMA2D_PPA_PMS_W_REG (DR_REG_DMA_PMS_BASE + 0x208)
/** PMS_DMA_DMA2D_PPA_W_PMS : R/W; bitpos: [31:0]; default: 4294967295;
 *  Configures 2D-DMA permission to write 32 address ranges requested by PPA. Bit 0
 *  corresponds to region0, and so on.
 *  0: Disable write permission.
 *  1: Enable write permission.
 */
#define PMS_DMA_DMA2D_PPA_W_PMS    0xFFFFFFFFU
#define PMS_DMA_DMA2D_PPA_W_PMS_M  (PMS_DMA_DMA2D_PPA_W_PMS_V << PMS_DMA_DMA2D_PPA_W_PMS_S)
#define PMS_DMA_DMA2D_PPA_W_PMS_V  0xFFFFFFFFU
#define PMS_DMA_DMA2D_PPA_W_PMS_S  0

/** PMS_DMA_DMA2D_DUMMY_PMS_R_REG register
 *  2D-DMA dummy read permission control register
 */
#define PMS_DMA_DMA2D_DUMMY_PMS_R_REG (DR_REG_DMA_PMS_BASE + 0x20c)
/** PMS_DMA_DMA2D_DUMMY_R_PMS : R/W; bitpos: [31:0]; default: 4294967295;
 *  Configures 2D-DMA permission to read 32 address ranges requested by Dummy. Bit 0
 *  corresponds to region0, and so on.
 *  0: Disable read permission.
 *  1: Enable read permission.
 */
#define PMS_DMA_DMA2D_DUMMY_R_PMS    0xFFFFFFFFU
#define PMS_DMA_DMA2D_DUMMY_R_PMS_M  (PMS_DMA_DMA2D_DUMMY_R_PMS_V << PMS_DMA_DMA2D_DUMMY_R_PMS_S)
#define PMS_DMA_DMA2D_DUMMY_R_PMS_V  0xFFFFFFFFU
#define PMS_DMA_DMA2D_DUMMY_R_PMS_S  0

/** PMS_DMA_DMA2D_DUMMY_PMS_W_REG register
 *  2D-DMA dummy write permission control register
 */
#define PMS_DMA_DMA2D_DUMMY_PMS_W_REG (DR_REG_DMA_PMS_BASE + 0x210)
/** PMS_DMA_DMA2D_DUMMY_W_PMS : R/W; bitpos: [31:0]; default: 4294967295;
 *  Configures 2D-DMA permission to write 32 address ranges requested by Dummy. Bit 0
 *  corresponds to region0, and so on.
 *  0: Disable write permission.
 *  1: Enable write permission.
 */
#define PMS_DMA_DMA2D_DUMMY_W_PMS    0xFFFFFFFFU
#define PMS_DMA_DMA2D_DUMMY_W_PMS_M  (PMS_DMA_DMA2D_DUMMY_W_PMS_V << PMS_DMA_DMA2D_DUMMY_W_PMS_S)
#define PMS_DMA_DMA2D_DUMMY_W_PMS_V  0xFFFFFFFFU
#define PMS_DMA_DMA2D_DUMMY_W_PMS_S  0

/** PMS_DMA_AHB_PDMA_DUMMY_R_PMS_REG register
 *  GDMA-AHB dummy read permission control register
 */
#define PMS_DMA_AHB_PDMA_DUMMY_R_PMS_REG (DR_REG_DMA_PMS_BASE + 0x214)
/** PMS_DMA_AHB_PDMA_DUMMY_R_PMS : R/W; bitpos: [31:0]; default: 4294967295;
 *  Configures GDMA-AHB permission to read 32 address ranges requested by Dummy. Bit 0
 *  corresponds to region0, and so on.
 *  0: Disable read permission.
 *  1: Enable read permission.
 */
#define PMS_DMA_AHB_PDMA_DUMMY_R_PMS    0xFFFFFFFFU
#define PMS_DMA_AHB_PDMA_DUMMY_R_PMS_M  (PMS_DMA_AHB_PDMA_DUMMY_R_PMS_V << PMS_DMA_AHB_PDMA_DUMMY_R_PMS_S)
#define PMS_DMA_AHB_PDMA_DUMMY_R_PMS_V  0xFFFFFFFFU
#define PMS_DMA_AHB_PDMA_DUMMY_R_PMS_S  0

/** PMS_DMA_AHB_PDMA_DUMMY_W_PMS_REG register
 *  GDMA-AHB dummy write permission control register
 */
#define PMS_DMA_AHB_PDMA_DUMMY_W_PMS_REG (DR_REG_DMA_PMS_BASE + 0x218)
/** PMS_DMA_AHB_PDMA_DUMMY_W_PMS : R/W; bitpos: [31:0]; default: 4294967295;
 *  Configures GDMA-AHB permission to write 32 address ranges requested by Dummy. Bit 0
 *  corresponds to region0, and so on.
 *  0: Disable write permission.
 *  1: Enable write permission.
 */
#define PMS_DMA_AHB_PDMA_DUMMY_W_PMS    0xFFFFFFFFU
#define PMS_DMA_AHB_PDMA_DUMMY_W_PMS_M  (PMS_DMA_AHB_PDMA_DUMMY_W_PMS_V << PMS_DMA_AHB_PDMA_DUMMY_W_PMS_S)
#define PMS_DMA_AHB_PDMA_DUMMY_W_PMS_V  0xFFFFFFFFU
#define PMS_DMA_AHB_PDMA_DUMMY_W_PMS_S  0

/** PMS_DMA_AXI_PDMA_DUMMY_R_PMS_REG register
 *  GDMA-AXI dummy read permission control register
 */
#define PMS_DMA_AXI_PDMA_DUMMY_R_PMS_REG (DR_REG_DMA_PMS_BASE + 0x21c)
/** PMS_DMA_AXI_PDMA_DUMMY_R_PMS : R/W; bitpos: [31:0]; default: 4294967295;
 *  Configures GDMA-AXI permission to read 32 address ranges requested by Dummy. Bit 0
 *  corresponds to region0, and so on.
 *  0: Disable read permission.
 *  1: Enable read permission.
 */
#define PMS_DMA_AXI_PDMA_DUMMY_R_PMS    0xFFFFFFFFU
#define PMS_DMA_AXI_PDMA_DUMMY_R_PMS_M  (PMS_DMA_AXI_PDMA_DUMMY_R_PMS_V << PMS_DMA_AXI_PDMA_DUMMY_R_PMS_S)
#define PMS_DMA_AXI_PDMA_DUMMY_R_PMS_V  0xFFFFFFFFU
#define PMS_DMA_AXI_PDMA_DUMMY_R_PMS_S  0

/** PMS_DMA_AXI_PDMA_DUMMY_W_PMS_REG register
 *  GDMA-AXI dummy write permission control register
 */
#define PMS_DMA_AXI_PDMA_DUMMY_W_PMS_REG (DR_REG_DMA_PMS_BASE + 0x220)
/** PMS_DMA_AXI_PDMA_DUMMY_W_PMS : R/W; bitpos: [31:0]; default: 4294967295;
 *  Configures GDMA-AXI permission to write 32 address ranges requested by Dummy. Bit 0
 *  corresponds to region0, and so on.
 *  0: Disable write permission.
 *  1: Enable write permission.
 */
#define PMS_DMA_AXI_PDMA_DUMMY_W_PMS    0xFFFFFFFFU
#define PMS_DMA_AXI_PDMA_DUMMY_W_PMS_M  (PMS_DMA_AXI_PDMA_DUMMY_W_PMS_V << PMS_DMA_AXI_PDMA_DUMMY_W_PMS_S)
#define PMS_DMA_AXI_PDMA_DUMMY_W_PMS_V  0xFFFFFFFFU
#define PMS_DMA_AXI_PDMA_DUMMY_W_PMS_S  0

#ifdef __cplusplus
}
#endif
